[{"name": "", "description": "Every resident shall be entitled to obtain an Aadhaar number by submitting his demographic information and biometric information by undergoing the process of enrolment: Provided that the Central Government may, from time to time, notify such other category of individuals who may be entitled to obtain an Aadhaar number.", "ref_code": "3,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The enrolling agency shall, at the time of enrolment, inform the individual\nundergoing enrolment of the following details in such manner as may be specified by regulations, namely:—\n(a) the manner in which the information shall be used;\n(b) the nature of recipients with whom the information is intended to be shared\nduring authentication; and\n(c) the existence of a right to access information, the procedure for making\nrequests for such access, and details of the person or department in-charge to whom such requests can be made.", "ref_code": "3,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "On receipt of the demographic information and biometric information under sub-section (1), the Authority shall, after verifying the information, in such manner as may be specified by regulations, issue an Aadhaar number to such individual.", "ref_code": "3,3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "An Aadhaar number, issued to an individual shall not be re-assigned to any other individual.", "ref_code": "4,1", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "An Aadhaar number shall be a random number and bear no relation to the attributes or identity of the Aadhaar number holder", "ref_code": "4,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "An Aadhaar number, in physical or electronic form subject to authentication and other conditions, as may be specified by regulations, may be accepted as proof of identity of the Aadhaar number holder for any purpose.", "ref_code": "4,3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority shall take special measures to issue Aadhaar number to women, children, senior citizens, persons with disability, unskilled and unorganised workers, nomadic tribes or to such other persons who do not have any permanent dwelling house and such other categories of individuals as may be specified by regulations.", "ref_code": "5,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority may require Aadhaar number holders to update their demographic information and biometric information, from time to time, in such manner as may be specified by regulations, so as to ensure continued accuracy of their information in the Central Identities Data Repository.", "ref_code": "6,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Central Government or, as the case may be, the State Government may, for the purpose of establishing identity of an individual as a condition for receipt of a subsidy, benefit or service for which the expenditure is incurred from, or the receipt therefrom forms part of, the Consolidated Fund of India, require that such individual undergo authentication, or furnish proof of possession of Aadhaar number or in the case of an individual to whom no Aadhaar number has been assigned, such individual makes an application for enrolment: Provided that if an Aadhaar number is not assigned to an individual, the individual shall be offered alternate and viable means of identification for delivery of the subsidy, benefit or service.", "ref_code": "7,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority shall perform authentication of the Aadhaar number of an Aadhaar number holder submitted by any requesting entity, in relation to his biometric information or demographic information, subject to such conditions and on payment of such fees and in such manner as may be specified by regulations.", "ref_code": "8,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "A requesting entity shall—\n(a) unless otherwise provided in this Act, obtain the consent of an individual\nbefore collecting his identity information for the purposes of authentication in such manner as may be specified by regulations; and\n(b) ensure that the identity information of an individual is only used for\nsubmission to the Central Identities Data Repository for authentication.", "ref_code": "8,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "A requesting entity shall inform, in such manner as may be specified by regulations, the individual submitting his identity information for authentication, the following details with respect to authentication, namely:—\n(a) the nature of information that may be shared upon authentication;\n(b) the uses to which the information received during authentication may be\nput by the requesting entity; and\n(c) alternatives to submission of identity information to the requesting entity", "ref_code": "8,3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority shall respond to an authentication query with a positive, negative or any other appropriate response sharing such identity information excluding any core biometric information.", "ref_code": "8,4", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Aadhaar number or the authentication thereof shall not, by itself, confer any right of, or be proof of, citizenship or domicile in respect of an Aadhaar number holder.", "ref_code": "9,1", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority may engage one or more entities to establish and maintain the Central Identities Data Repository and to perform any other functions as may be specified by regulations.", "ref_code": "10,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Central Government shall, by notification, establish an Authority to be known as the Unique Identification Authority of India to be responsible for the processes of enrolment and authentication and perform such other functions assigned to it under this Act.", "ref_code": "11,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority shall be a body corporate by the name aforesaid, having perpetual succession and a common seal, with power, subject to the provisions of this Act, to acquire, hold and dispose of property, both movable and immovable, and to contract, and shall, by the said name, sue or be sued.", "ref_code": "11,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The head office of the Authority shall be in New Delhi.", "ref_code": "11,3", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority may, with the prior approval of the Central Government, establish its offices at other places in India.", "ref_code": "11,4", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority shall consist of a Chairperson, appointed on part-time or full- time basis, two part-time Members, and the chief executive officer who shall be MemberSecretary of the Authority, to be appointed by the Central Government.", "ref_code": "12,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Chairperson and Members of the Authority shall be persons of ability and integrity having experience and knowledge of at least ten years in matters relating to technology, governance, law, development, economics, finance, management, public affairs or administration.", "ref_code": "13,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Chairperson and the Members appointed under this Act shall hold office for a term of three years from the date on which they assume office and shall be eligible for re-appointment: Provided that no person shall hold office as the Chairperson or Member after he has attained the age of sixty-five years.", "ref_code": "14,1", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Chairperson and every Member shall, before entering office, make and subscribe to, an oath of office and of secrecy, in such form and in such manner and before such Authority as may be prescribed.", "ref_code": "14,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": " Notwithstanding anything contained in sub-section (1), the Chairperson or Member may—\n(a) relinquish his office, by giving in writing to the Central Government, a notice\nof not less than thirty days; or\n(b) be removed from his office in accordance with the provisions of section 15.", "ref_code": "14,3", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The salaries and allowances payable to, and the other terms and conditions of service of, the Chairperson and allowances or remuneration payable to part-time Members shall be such as may be prescribed.", "ref_code": "14,4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Central Government may remove from office, the Chairperson, or a Member,\nwho—\n(a) is, or at any time has been adjudged as insolvent;\n(b) has become physically or mentally incapable of acting as the Chairperson\nor, as the case may be, a Member;\n(c) has been convicted of an offence which, in the opinion of the Central\nGovernment, involves moral turpitude;\n(d) has acquired such financial or other interest as is likely to affect prejudicially\nhis functions as the Chairperson or, as the case may be, a Member; or                            (e) has, in the opinion of the Central Government, so abused his position as to\nrender his continuance in office detrimental to the public interest.", "ref_code": "15,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Chairperson or a Member shall not be removed under clause (b), clause (d) or clause (e) of sub-section (1) unless he has been given a reasonable opportunity of being heard.", "ref_code": "15,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Chairperson or a Member on ceasing to hold office for any reason, shall not,\nwithout previous approval of the Central Government,—\n(a) accept any employment in, or be connected with the management of any\norganisation, company or any other entity which has been associated with any work done or contracted out by the Authority, whether directly or indirectly, during his tenure as Chairperson or Member, as the case may be, for a period of three years from the date on which he ceases to hold office: Provided that nothing contained in this clause shall apply to any employment under the Central Government or a State Government or local authority or in any statutory authority or any corporation established by or under any Central, State or provincial Act or a Government Company, as defined in clause (45) of section 2 of the Companies Act, 2013;\n(b) act, for or on behalf of any person or organisation in connection with any\nspecific proceeding or transaction or negotiation or a case to which the Authority is\na party and with respect to which the Chairperson or such Member had, before\ncessation of office, acted for or provided advice to, the Authority;\n(c) give advice to any person using information which was obtained in his capacity as the Chairperson or a Member and being unavailable to or not being able\nto be made available to the public; or\n(d) enter, for a period of three years from his last day in office, into a contract of\nservice with, accept an appointment to a board of directors of, or accept an offer of\nemployment with, an entity with which he had direct and significant official dealings during his term of office.", "ref_code": "16,1", "system_level": "", "category": "", "subcategory": "", "dti": "Difficult", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Chairperson shall preside over the meetings of the Authority, and without prejudice to any provision of this Act, exercise and discharge such other powers and functions of the Authority as may be prescribed.", "ref_code": "17,1", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "There shall be a chief executive officer of the Authority, not below the rank of Additional Secretary to the Government of India, to be appointed by the Central Government.", "ref_code": "18,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The chief executive officer shall be the legal representative of the Authority and\nshall be responsible for—\n(a) the day-to-day administration of the Authority;\n(b) implementing the work programmes and decisions adopted by the Authority;\n(c) drawing up of proposal for the Authority’s decisions and work programmes;\n(d) the preparation of the statement of revenue and expenditure and the execution of the budget of the Authority; and\n(e) performing such other functions, or exercising such other powers, as may be\nspecified by regulations.", "ref_code": "18,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Every year, the chief executive officer shall submit to the Authority for approval—\n(a) a general report covering all the activities of the Authority in the previous year;\n(b) programmes of work;\n(c) the annual accounts for the previous year; and\n(d) the budget for the coming year.", "ref_code": "18,3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The chief executive officer shall have administrative control over the officers and other employees of the Authority.", "ref_code": "18,4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority shall meet at such times and places and shall observe such rules of procedure in regard to the transaction of business at its meetings, including quorum at such meetings, as may be specified by regulations.", "ref_code": "19,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Chairperson, or, if for any reason, he is unable to attend a meeting of the Authority, the senior most Member shall preside over the meetings of the Authority.", "ref_code": "19,2", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "All questions which come up before any meeting of the Authority shall be decided by a majority of votes by the Members present and voting and in the event of an equality of votes, the Chairperson or in his absence the presiding Member shall have a casting vote.", "ref_code": "19,3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "All decisions of the Authority shall be signed by the Chairperson or any other Member or the Member-Secretary authorised by the Authority in this behalf.", "ref_code": "19,4", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "If any Member, who is a director of a company and who as such director, has any\ndirect or indirect pecuniary interest in any manner coming up for consideration at a meeting of the Authority, he shall, as soon as possible after relevant circumstances have come to his knowledge, disclose the nature of his interest at such meeting and such disclosure shall be recorded in the proceedings of the Authority, and the Member shall not take part in any deliberation or decision of the Authority with respect to that matter.", "ref_code": "19,5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "No act or proceeding of the Authority shall be invalid merely by reason of—\n(a) any vacancy in, or any defect in the constitution of, the Authority;\n(b) any defect in the appointment of a person as Chairperson or Member of the\nAuthority; or\n(c) any irregularity in the procedure of the Authority not affecting the merits of\nthe case.", "ref_code": "20,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority may, with the approval of the Central Government, determine the number, nature and categories of other officers and employees required by the Authority in the discharge of its functions.", "ref_code": "21,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The salaries and allowances payable to, and the other terms and conditions of service of, the chief executive officer and other officers and other employees of the Authority shall be such as may be specified by regulations with the approval of the Central Government.", "ref_code": "21,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "On and from the establishment of the Authority—\n(a) all the assets and liabilities of the Unique Identification Authority of India,\nestablished vide notification of the Government of India in the Planning Commission number A-43011/02/2009-Admin. I, dated the 28th January, 2009, shall stand transferred to, and vested in, the Authority.                                                                    (b) without prejudice to the provisions of clause (a), all data and information\ncollected during enrolment, all details of authentication performed, debts, obligations and liabilities incurred, all contracts entered into and all matters and things engaged to be done by, with or for such Unique Identification Authority of India immediately before that day, for or in connection with the purpose of the said Unique Identification Authority of India, shall be deemed to have been incurred, entered into or engaged to be done by, with or for, the Authority;               (c) all sums of money due to the said Unique Identification Authority of India\nimmediately before that day shall be deemed to be due to the Authority; and\n(d) all suits and other legal proceedings instituted or which could have been\ninstituted by or against such Unique Identification Authority of India immediately\nbefore that day may be continued or may be instituted by or against the Authority.                                                     ", "ref_code": "22,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority shall develop the policy, procedure and systems for issuing Aadhaar numbers to individuals and perform authentication thereof under this Act.", "ref_code": "23,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Without prejudice to sub-section (1), the powers and functions of the Authority,\ninter alia, include—\n(a) specifying, by regulations, demographic information and biometric\ninformation required for enrolment and the processes for collection and verification thereof;\n(b) collecting demographic information and biometric information from any\nindividual seeking an Aadhaar number in such manner as may be specified by\nregulations;\n(c) appointing of one or more entities to operate the Central Identities Data\nRepository;\n(d) generating and assigning Aadhaar numbers to individuals;\n(e) performing authentication of Aadhaar numbers;\n(f) maintaining and updating the information of individuals in the Central Identities Data Repository in such manner as may be specified by regulations;\n(g) omitting and deactivating of an Aadhaar number and information relating\nthereto in such manner as may be specified by regulations;\n(h) specifying the manner of use of Aadhaar numbers for the purposes of\nproviding or availing of various subsidies, benefits, services and other purposes for\nwhich Aadhaar numbers may be used;\n(i) specifying, by regulations, the terms and conditions for appointment of\nRegistrars, enrolling agencies and service providers and revocation of appointments thereof;\n(j) establishing, operating and maintaining of the Central Identities Data\nRepository;\n(k) sharing, in such manner as may be specified by regulations, the information\nof Aadhaar number holders, subject to the provisions of this Act;\n(l) calling for information and records, conducting inspections, inquiries and\naudit of the operations for the purposes of this Act of the Central Identities Data\nRepository, Registrars, enrolling agencies and other agencies appointed under this\nAct;\n(m) specifying, by regulations, various processes relating to data management,\nsecurity protocols and other technology safeguards under this Act;\n(n) specifying, by regulations, the conditions and procedures for issuance of\nnew Aadhaar number to existing Aadhaar number holder;\n(o) levying and collecting the fees or authorising the Registrars, enrolling\nagencies or other service providers to collect such fees for the services provided by\nthem under this Act in such manner as may be specified by regulations;\n(p) appointing such committees as may be necessary to assist the Authority in\ndischarge of its functions for the purposes of this Act;\n(q) promoting research and development for advancement in biometrics and\nrelated areas, including usage of Aadhaar numbers through appropriate mechanisms;                                                                                                                                              (r) evolving of, and specifying, by regulations, policies and practices for\nRegistrars, enrolling agencies and other service providers;\n(s) setting up facilitation centres and grievance redressal mechanism for redressal\nof grievances of individuals, Registrars, enrolling agencies and other service providers;\n(t) such other powers and functions as may be prescribed.", "ref_code": "23,2", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority may,—\n(a) enter into Memorandum of Understanding or agreement, as the case may\nbe, with the Central Government or State Governments or Union territories or other agencies for the purpose of performing any of the functions in relation to collecting, storing, securing or processing of information or delivery of Aadhaar numbers to individuals or performing authentication;\n(b) by notification, appoint such number of Registrars, engage and authorise\nsuch agencies to collect, store, secure, process information or do authentication or\nperform such other functions in relation thereto, as may be necessary for the purposes of this Act.", "ref_code": "23,3", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority may engage such consultants, advisors and other persons as may be required for efficient discharge of its functions under this Act on such allowances or remuneration and terms and conditions as may be specified by contract.", "ref_code": "23,4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Central Government may, after due appropriation made by Parliament by law in this behalf, make to the Authority, grants of such sums of money as the Central Government may think fit for being utilised for the purposes of this Act.", "ref_code": "24,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The fees or revenue collected by the Authority shall be credited to the Consolidated Fund of India.", "ref_code": "25,1", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority shall maintain proper accounts and other relevant records and prepare an annual statement of accounts in such form as may be prescribed by the Central Government in consultation with the Comptroller and Auditor-General of India.", "ref_code": "26,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The accounts of the Authority shall be audited annually by the Comptroller and Auditor-General of India at such intervals as may be specified by him and any expenditure incurred in connection with such audit shall be payable by the Authority to the Comptroller and Auditor-General.", "ref_code": "26,2", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Comptroller and Auditor-General of India and any person appointed by him in connection with the audit the accounts of the Authority under this Act shall have the same rights and privileges and authority in connection with such audit as the Comptroller and Auditor-General generally has in connection with the audit of Government accounts, and in particular, shall have the right to demand production of books, accounts, connected vouchers and other documents and papers, and to inspect any of the offices of the Authority.", "ref_code": "26,3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The accounts of the Authority, as certified by the Comptroller and Auditor-General of India or any other person appointed by him in this behalf, together with the audit report thereon shall be forwarded annually to the Central Government by the Authority and the Central Government shall cause the audit report to be laid, as soon as may be after it is received, before each House of Parliament.", "ref_code": "26,4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority shall furnish to the Central Government at such time and in such form and manner as may be prescribed or as the Central Government may direct, such returns and statements and particulars in regard to any matter under the jurisdiction of the Authority, as the Central Government may from time to time require.", "ref_code": "27,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority shall prepare, once in every year, and in such form and manner and\nat such time as may be prescribed, an annual report giving—\n(a) a description of all the activities of the Authority for the previous years;\n(b) the annual accounts for the previous year; and\n(c) the programmes of work for coming year.", "ref_code": "27,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "A copy of the report received under sub-section (2) shall be laid by the Central Government, as soon as may be after it is received, before each House of Parliament.", "ref_code": "27,3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority shall ensure the security of identity information and authentication records of individuals.", "ref_code": "28,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Subject to the provisions of this Act, the Authority shall ensure confidentiality of identity information and authentication records of individuals.", "ref_code": "28,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority shall take all necessary measures to ensure that the information in the possession or control of the Authority, including information stored in the Central Identities Data Repository, is secured and protected against access, use or disclosure not permitted under this Act or regulations made thereunder, and against accidental or intentional destruction, loss or damage.", "ref_code": "28,3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Without prejudice to sub-sections (1) and (2), the Authority shall—\n(a) adopt and implement appropriate technical and organisational security\nmeasures;\n(b) ensure that the agencies, consultants, advisors or other persons appointed\nor engaged for performing any function of the Authority under this Act, have in place appropriate technical and organisational security measures for the information; and\n(c) ensure that the agreements or arrangements entered into with such agencies,\nconsultants, advisors or other persons, impose obligations equivalent to those\nimposed on the Authority under this Act, and require such agencies, consultants,\nadvisors and other persons to act only on instructions from the Authority.", "ref_code": "28,4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "Notwithstanding anything contained in any other law for the time being in force, and save as otherwise provided in this Act, the Authority or any of its officers or other employees or any agency that maintains the Central Identities Data Repository shall not, whether during his service or thereafter, reveal any information stored in the Central Identities Data Repository or authentication record to anyone: Provided that an Aadhaar number holder may request the Authority to provide access to his identity information excluding his core biometric information in such manner as may be specified by regulations.", "ref_code": "28,5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "No core biometric information, collected or created under this Act, shall be—\n(a) shared with anyone for any reason whatsoever; or\n(b) used for any purpose other than generation of Aadhaar numbers and\nauthentication under this Act.", "ref_code": "29,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The identity information, other than core biometric information, collected or created under this Act may be shared only in accordance with the provisions of this Act and in such manner as may be specified by regulations.", "ref_code": "29,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "No identity information available with a requesting entity shall be—\n(a) used for any purpose, other than that specified to the individual at the time\nof submitting any identity information for authentication; or                                             (b) disclosed further, except with the prior consent of the individual to whom\nsuch information relates.", "ref_code": "29,3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "No Aadhaar number or core biometric information collected or created under this Act in respect of an Aadhaar number holder shall be published, displayed or posted publicly, except for the purposes as may be specified by regulations.", "ref_code": "29,4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The biometric information collected and stored in electronic form, in accordance with this Act and regulations made thereunder, shall be deemed to be “electronic record” and “sensitive personal data or information”, and the provisions contained in the Information Technology Act, 2000 and the rules made thereunder shall apply to such information, in addition to, and to the extent not in derogation of the provisions of this Act.", "ref_code": "30,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "In case any demographic information of an Aadhaar number holder is found incorrect or changes subsequently, the Aadhaar number holder shall request the Authority to alter such demographic information in his record in the Central Identities Data Repository in such manner as may be specified by regulations.", "ref_code": "31,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "In case any biometric information of Aadhaar number holder is lost or changes subsequently for any reason, the Aadhaar number holder shall request the Authority to make necessary alteration in his record in the Central Identities Data Repository in such manner as may be specified by regulations.", "ref_code": "31,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "On receipt of any request under sub-section (1) or sub-section (2), the Authority may, if it is satisfied, make such alteration as may be required in the record relating to such Aadhaar number holder and intimate such alteration to the concerned Aadhaar number holder", "ref_code": "31,3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "No identity information in the Central Identities Data Repository shall be altered except in the manner provided in this Act or regulations made in this behalf.", "ref_code": "31,4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority shall maintain authentication records in such manner and for such period as may be specified by regulations.", "ref_code": "32,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Every Aadhaar number holder shall be entitled to obtain his authentication record in such manner as may be specified by regulations.", "ref_code": "32,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority shall not, either by itself or through any entity under its control, collect, keep or maintain any information about the purpose of authentication.", "ref_code": "32,3", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "Nothing contained in sub-section (2) or sub-section (5) of section 28 or sub-section (2) of section 29 shall apply in respect of any disclosure of information, including identity information or authentication records, made pursuant to an order of a court not inferior to that of a District Judge: Provided that no order by the court under this sub-section shall be made without giving an opportunity of hearing to the Authority.", "ref_code": "33,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Nothing contained in sub-section (2) or sub-section (5) of section 28 and\nclause (b) of sub-section (1), sub-section (2) or sub-section (3) of section 29 shall apply in respect of any disclosure of information, including identity information or authentication records, made in the interest of national security in pursuance of a direction of an officer not below the rank of Joint Secretary to the Government of India specially authorised in this behalf by an order of the Central Government:\nProvided that every direction issued under this sub-section, shall be reviewed by an Oversight Committee consisting of the Cabinet Secretary and the Secretaries to the Government of India in the Department of Legal Affairs and the Department of Electronics and Information Technology, before it takes effect:", "ref_code": "33,2", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "Whoever impersonates or attempts to impersonate another person, whether dead or alive, real or imaginary, by providing any false demographic information or biometric information, shall be punishable with imprisonment for a term which may extend to three years or with a fine which may extend to ten thousand rupees or with both.", "ref_code": "34,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Whoever, with the intention of causing harm or mischief to an Aadhaar number holder, or with the intention of appropriating the identity of an Aadhaar number holder changes or attempts to change any demographic information or biometric information of an Aadhaar number holder by impersonating or attempting to impersonate another person, dead or alive, real or imaginary, shall be punishable with imprisonment for a term which may extend to three years and shall also be liable to a fine which may extend to ten thousand rupees.", "ref_code": "35,1", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Whoever, not being authorised to collect identity information under the provisions of this Act, by words, conduct or demeanour pretends that he is authorised to do so, shall be punishable with imprisonment for a term which may extend to three years or with a fine which may extend to ten thousand rupees or, in the case of a company, with a fine which may extend to one lakh rupees or with both.", "ref_code": "36,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Whoever, intentionally discloses, transmits, copies or otherwise disseminates any identity information collected in the course of enrolment or authentication to any person not authorised under this Act or regulations made thereunder or in contravention of any agreement or arrangement entered into pursuant to the provisions of this Act, shall be punishable with imprisonment for a term which may extend to three years or with a fine which may extend to ten thousand rupees or, in the case of a company, with a fine which may extend to one lakh rupees or with both.", "ref_code": "37,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "Whoever, not being authorised by the Authority, intentionally,—\n(a) accesses or secures access to the Central Identities Data Repository;\n(b) downloads, copies or extracts any data from the Central Identities Data\nRepository or stored in any removable storage medium;\n(c) introduces or causes to be introduced any virus or other computer contaminant in the Central Identities Data Repository;\n(d) damages or causes to be damaged the data in the Central Identities Data\nRepository;\n(e) disrupts or causes disruption of the access to the Central Identities Data\nRepository;\n(f) denies or causes a denial of access to any person who is authorised to\naccess the Central Identities Data Repository;                                                                             (g) reveals any information in contravention of sub-section (5) of section 28, or\nshares, uses or displays information in contravention of section 29 or assists any\nperson in any of the aforementioned acts;\n(h) destroys, deletes or alters any information stored in any removable storage\nmedia or in the Central Identities Data Repository or diminishes its value or utility or affects it injuriously by any means; or\n(i) steals, conceals, destroys or alters or causes any person to steal, conceal,\ndestroy or alter any computer source code used by the Authority with an intention to cause damage,\nshall be punishable with imprisonment for a term which may extend to three years and shall also be liable to a fine which shall not be less than ten lakh rupees.", "ref_code": "38,1", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Moderate the collection and enforcement of control id 381 requires knowledge of computer security and technical skills to prevent unauthorized access or damage to the central identities data repository however, with appropriate training and experience, an engineer in systems of information should be able to manage compliance with the aadhaar act effectively", "meta": {}, "subcontrols": []}, {"name": "", "description": "Whoever, not being authorised by the Authority, uses or tampers with the data in the Central Identities Data Repository or in any removable storage medium with the intent of modifying information relating to Aadhaar number holder or discovering any information thereof, shall be punishable with imprisonment for a term which may extend to three years and shall also be liable to a fine which may extend to ten thousand rupees.", "ref_code": "39,1", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "Whoever, being a requesting entity, uses the identity information of an individual in contravention of sub-section (3) of section 8, shall be punishable with imprisonment which may extend to three years or with a fine which may extend to ten thousand rupees or, in the case of a company, with a fine which may extend to one lakh rupees or with both.", "ref_code": "40,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Whoever, being an enrolling agency or a requesting entity, fails to comply with the requirements of sub-section (2) of section 3 or sub-section (3) of section 8, shall be punishable with imprisonment which may extend to one year or with a fine which may extend to ten thousand rupees or, in the case of a company, with a fine which may extend to one lakh rupees or with both.", "ref_code": "41,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Whoever commits an offence under this Act or any rules or regulations made thereunder for which no specific penalty is provided elsewhere than this section, shall be punishable with imprisonment for a term which may extend to one year or with a fine which may extend to twenty-five thousand rupees or, in the case of a company, with a fine which may extend to one lakh rupees, or with both.", "ref_code": "42,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Where an offence under this Act has been committed by a company, every person who at the time the offence was committed was in charge of, and was responsible to, the company for the conduct of the business of the company, as well as the company, shall be deemed to be guilty of the offence and shall be liable to be proceeded against and punished accordingly: Provided that nothing contained in this sub-section shall render any such person liable to any punishment provided in this Act if he proves that the offence was committed without his knowledge or that he had exercised all due diligence to prevent the commission of such offence.", "ref_code": "43,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Notwithstanding anything contained in sub-section (1), where any offence under this Act has been committed by a company and it is proved that the offence has been committed with the consent or connivance of, or is attributable to, any neglect on the part of any director, manager, secretary or other officer of the company, such director, manager, secretary or other officer shall also be deemed to be guilty of the offence and shall be liable to be proceeded against and punished accordingly.", "ref_code": "43,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Subject to the provisions of sub-section (2), the provisions of this Act shall apply also to any offence or contravention committed outside India by any person, irrespective of his nationality.", "ref_code": "44,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "For the purposes of sub-section (1), the provisions of this Act shall apply to any offence or contravention committed outside India by any person, if the act or conduct constituting the offence or contravention involves any data in the Central Identities Data Repository.", "ref_code": "44,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Notwithstanding anything contained in the Code of Criminal Procedure, 1973, a police officer not below the rank of Inspector of Police shall investigate any offence under this Act.", "ref_code": "45,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "No penalty imposed under this Act shall prevent the imposition of any other penalty or punishment under any other law for the time being in force.", "ref_code": "46,1", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "No court shall take cognizance of any offence punishable under this Act, save\non a complaint made by the Authority or any officer or person authorised by it.", "ref_code": "47,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "No court inferior to that of a Chief Metropolitan Magistrate or a Chief Judicial Magistrate shall try any offence punishable under this Act.", "ref_code": "47,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "If, at any time, the Central Government is of the opinion,—\n(a) that, on account of circumstances beyond the control of the Authority, it\nis unable to discharge the functions or perform the duties imposed on it by or under the provisions of this Act; or\n(b) that the Authority has persistently defaulted in complying with any direction\ngiven by the Central Government under this Act or in the discharge of the functions\nor performance of the duties imposed on it by or under the provisions of this Act and as a result of such default the financial position of the Authority or the administration of the Authority has suffered; or\n(c) that a public emergency exists, the Central Government may, by notification, supersede the Authority for such period, not exceeding six months, as may be specified in the notification and appoint a person or persons as the President may direct to exercise powers and discharge functions under this Act: Provided that before issuing any such notification, the Central Government shall give a reasonable opportunity to the Authority to make representations against the\nproposed supersession and shall consider the representations, if any, of the Authority.", "ref_code": "48,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Upon the publication of a notification under sub-section (1), superseding the\nAuthority,—\n(a) the Chairperson and other Members shall, as from the date of supersession,\nvacate their offices as such;\n(b) all the powers, functions and duties which may, by or under the provisions\nof this Act, be exercised or discharged by or on behalf of the Authority shall, until the Authority is reconstituted under sub-section (3), be exercised and discharged by the person or persons referred to in sub-section (1); and\n(c) all properties owned or controlled by the Authority shall, until the Authority\nis reconstituted under sub-section (3), vest in the Central Government", "ref_code": "48,2", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "On or before the expiration of the period of supersession specified in the notification issued under sub-section (1), the Central Government shall reconstitute the Authority by a fresh appointment of its Chairperson and other Members and in such case any person who had vacated his office under clause (a) of sub-section (2) shall not be deemed to be disqualified for reappointment.", "ref_code": "48,3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Central Government shall cause a copy of the notification issued under sub-section (1) and a full report of any action taken under this section and the circumstances leading to such action to be laid before each House of Parliament at the earliest.", "ref_code": "48,4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Chairperson, Members, officers and other employees of the Authority shall be deemed, while acting or purporting to act in pursuance of any of the provisions of this Act, to be public servants within the meaning of section 21 of the Indian Penal Code.", "ref_code": "49,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Without prejudice to the foregoing provisions of this Act, the Authority shall, in exercise of its powers or the performance of its functions under this Act be bound by such directions on questions of policy, as the Central Government may give, in writing to it, from time to time: Provided that the Authority shall, as far as practicable, be given an opportunity to express its views before any direction is given under this sub-section: Provided further that nothing in this section shall empower the Central Government to issue directions pertaining to technical or administrative matters undertaken by the Authority.", "ref_code": "50,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The decision of the Central Government, whether a question is one of policy or not, shall be final.", "ref_code": "50,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority may, by general or special order in writing, delegate to any Member, officer of the Authority or any other person, subject to such conditions, if any, as may be specified in the order, such of its powers and functions under this Act (except the power under section 54) as it may deem necessary.", "ref_code": "51,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "No suit, prosecution or other legal proceeding shall lie against the Central Government or the Authority or the Chairperson or any Member or any officer, or other employees of the Authority for anything which is in good faith done or intended to be done under this Act or the rule or regulation made thereunder.", "ref_code": "52,1", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Central Government may, by notification, make rules to carry out the provisions of this Act.", "ref_code": "53,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": " In particular, and without prejudice to the generality of the foregoing power, such\nrules may provide for all or any of the following matters, namely:—\n(a) the form and manner in which and the authority before whom the oath of\noffice and of secrecy is to be subscribed by the Chairperson and Members under\nsub-section (2) of section 14;\n(b) the salary and allowances payable to, and other terms and conditions of\nservice of, the Chairperson and the allowances or remuneration payable to Members of the Authority under sub-section (4) of section 14;\n(c) the other powers and functions of the Chairperson of the Authority under\nsection 17;\n(d) the other powers and functions of the Authority under clause (t) of\nsub-section (2) of section 23;                                                                                                              (e) the form of annual statement of accounts to be prepared by Authority under\nsub-section (1) of section 26;\n(f) the form and the manner in which and the time within which returns and\nstatements and particulars are to be furnished under sub-section (1) of section 27;\n(g) the form and the manner and the time at which the Authority shall furnish\nannual report under sub-section (2) of section 27;\n(h) any other matter which is required to be, or may be, prescribed, or in respect\nof which provision is to be or may be made by rules.", "ref_code": "53,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Authority may, by notification, make regulations consistent with this Act and the rules made thereunder, for carrying out the provisions of this Act.", "ref_code": "54,1", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "In particular, and without prejudice to the generality of the foregoing power, such\nregulations may provide for all or any of the following matters, namely:—\n(a) the biometric information under clause (g) and the demographic information\nunder clause (k), and the process of collecting demographic information and biometric information from the individuals by enrolling agencies under clause (m) of section 2;\n(b) the manner of verifying the demographic information and biometric\ninformation for issue of Aadhaar number under sub-section (3) of section 3;\n(c) the conditions for accepting an Aadhaar number as proof of identity of the\nAadhaar number holder under sub-section (3) of section 4;\n(d) the other categories of individuals under section 5 for whom the Authority\nshall take special measures for allotment of Aadhaar number;\n(e) the manner of updating biometric information and demographic information\nunder section 6;\n(f) the procedure for authentication of the Aadhaar number under section 8;\n(g) the other functions to be performed by the Central Identities Data Repository\nunder section 10;\n(h) the time and places of meetings of the Authority and the procedure for\ntransaction of business to be followed by it, including the quorum, under\nsub-section (1) of section 19;\n(i) the salary and allowances payable to, and other terms and conditions of\nservice of, the chief executive officer, officers and other employees of the Authority under sub-section (2) of section 21;\n(j) the demographic information and biometric information under clause (a) and\nthe manner of their collection under clause (b) of sub-section (2) of section 23;\n(k) the manner of maintaining and updating the information of individuals in the\nCentral Identities Data Repository under clause (f) of sub-section (2) of section 23;\n(l) the manner of omitting and deactivating an Aadhaar number and information\nrelating thereto under clause (g) of sub-section (2) of section 23;\n(m) the manner of use of Aadhaar numbers for the purposes of providing or\navailing of various subsidies, benefits, services and other purposes for which Aadhaar numbers may be used under clause (h) of sub-section (2) of section 23;\n(n) the terms and conditions for appointment of Registrars, enrolling agencies\nand other service providers and the revocation of appointments thereof under\nclause (i) of sub-section (2) of section 23;\n(o) the manner of sharing information of Aadhaar number holder under\nclause (k) of sub-section (2) of section 23;                                                                                     (p) various processes relating to data management, security protocol and other\ntechnology safeguards under clause (m) of sub-section (2) of section 23;\n(q) the procedure for issuance of new Aadhaar number to existing Aadhaar\nnumber holder under clause (n) of sub-section (2) of section 23;\n(r) manner of authorising Registrars, enrolling agencies or other service providers to collect such fees for services provided by them under clause (o) of\nsub-section (2) of section 23;\n(s) policies and practices to be followed by the Registrar, enrolling agencies and\nother service providers under clause (r) of sub-section (2) of section 23;\n(t) the manner of accessing the identity information by the Aadhaar number\nholder under the proviso to sub-section (5) of section 28;\n(u) the manner of sharing the identity information, other than core biometric\ninformation, collected or created under this Act under sub-section (2) of section 29;\n(v) the manner of alteration of demographic information under sub-section (1)\nand biometric information under sub-section (2) of section 31;\n(w) the manner of and the time for maintaining the request for authentication\nand the response thereon under sub-section (1), and the manner of obtaining, by the Aadhaar number holder, the authentication records under sub-section (2) of\nsection 32;\n(x) any other matter which is required to be, or may be, specified, or in respect\nof which provision is to be or may be made by regulations.", "ref_code": "54,2", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "Every rule and every regulation made under this Act shall be laid, as soon as may be after it is made, before each House of Parliament, while it is in session, for a total period of thirty days which may be comprised in one session or in two or more successive sessions, and if, before the expiry of the session immediately following the session or the successive sessions aforesaid, both Houses agree in making any modification in the rule or regulation, or both the Houses agree that the rule or regulation should not be made, the rule or regulation shall thereafter have effect only in such modified form or be of no effect, as the case may be; so, however, that any such modification or annulment shall be without prejudice to the validity of anything previously done under that rule or regulation.", "ref_code": "55,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The provisions of this Act shall be in addition to, and not in derogation of, any other law for the time being in force.", "ref_code": "56,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Nothing contained in this Act shall prevent the use of Aadhaar number for establishing the identity of an individual for any purpose, whether by the State or any body corporate or person, pursuant to any law, for the time being in force, or any contract to this effect: Provided that the use of Aadhaar number under this section shall be subject to the procedure and obligations under section 8 and Chapter VI.", "ref_code": "57,1", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "If any difficulty arises in giving effect to the provisions of this Act, the Central Government may, by order, published in the Official Gazette, make such provisions not inconsistent with the provisions of this Act as may appear to be necessary for removing the difficulty: Provided that no such order shall be made under this section after the expiry of three years from the commencement of this Act.", "ref_code": "58,1", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Every order made under this section shall be laid, as soon as may be after it is made, before each House of Parliament.", "ref_code": "58,2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Anything done or any action taken by the Central Government under the Resolution of the Government of India, Planning Commission bearing notification number A-43011/02/2009-Admin. I, dated the 28th January, 2009, or by the Department of Electronics and Information Technology under the Cabinet Secretariat Notification bearing notification number S.O. 2492(E), dated the 12th September, 2015, as the case may be, shall be deemed to have been validly done or taken under this Act.", "ref_code": "59,1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}]