[{"name": "Understanding the organization and its context ", "description": "This clause requires the organization to determine all internal and external issues that may be relevant to its business purposes and to the achievement of the objectives of the BCMS itself. This includes all elements that affect, or may be affected by, potential disruptive incidents. ", "ref_code": "4.1.1", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Clarify who interested parties are and specify their requirements.", "description": "The standard requires the organization to assess who the interest parties are in terms of its BCMS, what their needs and expectations may be, which legal and regulatory requirements are applicable, and consequently, if any of these should become compliance obligations. Legal and regulatory requirements must be documented, kept updated, and communicated to all interested parties.", "ref_code": "4.2.1", "system_level": "", "category": "", "subcategory": "", "dti": "hard", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Consider legal and regulatory requirements when designing BCMS.", "description": "The standard requires the organization to assess who the interest parties are in terms of its BCMS, what their needs and expectations may be, which legal and regulatory requirements are applicable, and consequently, if any of these should become compliance obligations. Legal and regulatory requirements must be documented, kept updated, and communicated to all interested parties.", "ref_code": "4.2.2", "system_level": "", "category": "", "subcategory": "", "dti": "hard", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Think about what organization's BCMS should cover.", "description": "The scope and boundaries of the BCMS must be examined and defined considering the internal and external issues, interested parties, their needs and expectations, as well as legal and regulatory compliance obligations. Additional required considerations for the BCMS scope are: products, services, and organizational size, nature, and complexity. The scope and justified exclusions must be kept as “documented information.” ", "ref_code": "4.3.1", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Establish your requirements and define the scope of BCMS.", "description": "The scope and boundaries of the BCMS must be examined and defined considering the internal and external issues, interested parties, their needs and expectations, as well as legal and regulatory compliance obligations. Additional required considerations for the BCMS scope are: products, services, and organizational size, nature, and complexity. The scope and justified exclusions must be kept as “documented information.” ", "ref_code": "4.3.2", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Business continuity management system", "description": "The standard indicates that a BCMS should be established and operated and, by using interacting processes, be controlled and continuously improved. ", "ref_code": "4.4.1", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Provide leadership for your organization's BCMS", "description": "Top management and line managers with relevant roles in the organization must demonstrate genuine effort to engage people to support the BCMS. ", "ref_code": "5.1.1", "system_level": "", "category": "", "subcategory": "", "dti": "easy", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Show the support to organization's BCMS", "description": "This clause provides many examples of top management commitment with enhanced levels of leadership, involvement, and cooperation in the operation of the BCMS, by ensuring aspects like:                                      1) business continuity policy and objectives alignment with each other, and with the strategic policies and overall direction of the business.      2) business continuity activities integration with other business systems, where applicable .                                                                                        3) provision for resources so the BCMS can be operated efficiently .       4) definition of business continuity responsibilities to people within the BCMS, and their correct support, training, and guidance to complete their tasks effectively .                                                                              5) relevant, proper, and timely communication with both internal and external interested parties .                                                                                        6) support of the BCMS during all its lifecycle, considering a PCDA approach .", "ref_code": "5.2.1", "system_level": "", "category": "", "subcategory": "", "dti": "hard", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Establish a suitable BCMS policy for organization", "description": "Top management has the responsibility to establish a business continuity policy, which is aligned to the organization’s purpose, provides a framework for setting business continuity objectives, including a commitment to attend applicable requirements and, with the BCMS, continual improvement and its results. The business continuity policy must be maintained as documented information, be communicated within the organization, be available to all interested parties, and be periodically reviewed, or when significant changes occur in the organizational context. ", "ref_code": "5.3.1", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Assign responsibility and authority for BCMS", "description": "The standard states that it is the responsibility of top management to ensure that roles, responsibilities, and authorities are delegated and communicated effectively. The responsibility shall also be assigned to ensure that the BCMS meets the terms of the ISO 22301:2012 standard itself, and that the BCMS performance can be accurately reported to top management. ", "ref_code": "5.4.1", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Specify actions to manage risks and address opportunities", "description": "Before the ISO 22301 standard, the most widely used reference for Business Continuity Management Systems was BS 25999-2. In fact, ISO 22301 was mostly based on BS 25999-2, and this clause 6.1 seeks to replace the “preventive action” stated in BS 25999-2. The organization must plan actions to handle risks and opportunities relevant to the context of the organization (section 4.1) and the needs and expectations of interested parties (section 4.2), as a way to ensure that the BCMS can achieve its intended outcomes and results, prevent or mitigate undesired consequences, and continuously improve.", "ref_code": "6.1.1", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Set business continuity objectives and develop plans to achieve them.", "description": "Business continuity objectives should be established and communicated at appropriate levels and intervals, having considered the alignment with the business continuity policy, minimum levels of delivery of products and services, and compliance obligations.", "ref_code": "6.2.1", "system_level": "", "category": "", "subcategory": "", "dti": "hard", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Support BCMS by providing the necessary resources.", "description": "the standard states that resources required by the BCMS to achieve stated objectives and show continual improvement must be made available by the organization. ", "ref_code": "7.1.1", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Support BCMS by making sure that people are competent", "description": "The competence of people given responsibility for the BCMS who work under the organization’s control must meet the terms of the ISO 22301:2012 standard, to ensure they are capable and confident. ", "ref_code": "7.2.1", "system_level": "", "category": "", "subcategory": "", "dti": "easy", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Support BCMS by making people aware of their responsibilities.", "description": "Awareness is closely related to competence in the standard. People who work under the organization’s control must be made aware of the business continuity policy and its contents, what their personal performance means to the BCMS and its objectives, what the implications of nonconformities may be to the BCMS, and which roles they must perform during disruptive incidents. ", "ref_code": "7.3.1", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Support your BCMS by establishing communication procedures.", "description": "Processes for internal and external communication need to be established and recorded as documented information within the BCMS. The key elements that need to be decided, actioned, and recorded are what needs to be communicated, when it should be done, and who needs to receive the communication. ", "ref_code": "7.4.1", "system_level": "", "category": "", "subcategory": "", "dti": "easy", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Provide the information and documents that BCMS needs", "description": "“Documented information,” which you will see mentioned several times during this white paper, now covers both the “documents” and “records” concepts seen in the previous revision of the ISO 22301 standard. ", "ref_code": "7.5.1", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Creating and updating ", "description": "The standard requires that documented information created or updated in the scope of the BCMS must be properly identified and described, also considering its content presentation, and media used. All documented information must go under proper review and approval procedures to ensure it is fit for purpose. ", "ref_code": "7.5.2", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Control of documented information ", "description": "For a proper control of documented information, the organization must consider for them the provision of processes regarding the distribution, retention, access, usage, retrieval, preservation and storage, control, and disposition. ", "ref_code": "7.5.3", "system_level": "", "category": "", "subcategory": "", "dti": "easy", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Carry out process planning and establish controls", "description": "To ensure that risks and opportunities are treated properly (clause 6.1), and that the standard’s requirements are fulfilled, a BCMS must define clear criteria to plan, implement, and control its processes, as well as any relevant outsourced process, effectively implement those controls, and retain documented information deemed to be necessary to provide confidence the processes are being performed and achieving their results as planned.", "ref_code": "8.1.1", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Establish a process to analyze impacts and assess risks.", "description": "The standard requires that adverse impacts to the organization’s products, services, and operations must be systematically analyzed and treated, considering criteria to define potential disruption events, business, legal and other requirements the organization must fulfill, the main risks to be treated, and strategies to be followed.", "ref_code": "8.2.1", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Evaluate and set business continuity and recovery priorities.", "description": "The standard recognizes that organizations’ resources are not infinite, and that they play an even more critical role during disruptive events, so it requires their BCMS to have means, kept as documented information, to systematically identify continuity and recovery priorities and define objectives and goals to be achieved, in terms of minimal acceptable performance and time to achieve those. ", "ref_code": "8.2.2", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Assess risks and identify risk treatment options.", "description": "To help support a business impact analysis, an organization’s BCMS must have in place, as documented information, a risk assessment process to identify, analyze, evaluate, and treat risks that may lead to disruptive situations. The risk assessment and treatment criteria must consider business continuity objectives and the organization’s risk appetite.", "ref_code": "8.2.3", "system_level": "", "category": "", "subcategory": "", "dti": "hard", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Determination and selection ", "description": "The overall way an organization outlines its business continuity strategy must consider the business continuity analysis results and cover the protection, stabilization, continuity, resume and recovery of priority activities, and the mitigation, response, and management of impacts resulting from a disruptive event. During the business continuity strategy definition and selection activities, interdependencies and support resources must also be considered. ", "ref_code": "8.3.1", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Establishing resources requirements ", "description": "To support business continuity strategies, the organization must define needed resources, like people, information and data, buildings and facilities, equipment and consumable resources, transportation, suppliers and partners.", "ref_code": "8.3.2", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Protection and mitigation ", "description": "Considering its risk appetite, the organization must consider protective and mitigation controls to minimize disruption probabilities, disruption duration, and the impact of disruptions over products and services. ", "ref_code": "8.3.3", "system_level": "", "category": "", "subcategory": "", "dti": "hard", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Establish disruption and continuity management procedures.", "description": "To ensure activities’ continuity and incident management in line with the recovery objectives identified during the business impact analysis, an organization must establish, implement, maintain, and document business continuity procedures. ", "ref_code": "8.4.1", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Incident response structure ", "description": "To effectively respond to a disruption, ISO 22301:2012 requires an organization to have in place procedures and people, with proper authority and competence, to manage incidents, considering the incident identification, impact nature and extension evaluation, and activation of proper continuity response, including communications with relevant interested parties. ", "ref_code": "8.4.2", "system_level": "", "category": "", "subcategory": "", "dti": "hard", "dtc": "hard", "meta": {}, "subcontrols": []}, {"name": "Warning and communication ", "description": "Besides procedures to handle incidents (clause 8.4.2), an organization’s BCMS must have in place procedures to detect real and potential incidents, and manage communication with interested parties, internal and external, including risk warning systems. ", "ref_code": "8.4.3", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Business continuity plan ", "description": "In this clause, the standard states that the organization must plan to take actions to respond to disruptive incidents, ensure operations continuity and recovery within defined objectives and goals, and fulfill additional requirements from those who will use it.", "ref_code": "8.4.4", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Establish suitable business recovery and restoration procedures.", "description": "ISO 22301:2012 also requires a BCMS to have, as documented procedures, the activities needed to restore and return business activities from temporary conditions, defined as achieving the minimum performance levels agreed upon for a situation of “business as usual,” operating under normal conditions", "ref_code": "8.4.5", "system_level": "", "category": "", "subcategory": "", "dti": "hard", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Conduct exercises and test business continuity plans and procedures", "description": "Business continuity procedures must be systematically and periodically exercised and tested to ensure they are fit for purpose, updated, and compatible with continuity objectives.All planned exercises and tests must be aligned with the BCMS scope and objectives, considering possible scenarios, the information that must be recorded to provide data for exercising and testing critical review, so the accuracy of the planned actions and the interactions between interested parties can be evaluated, as well as the plans’ capability to achieve their defined objectives, increasing confidence on planning effectiveness or collaborating for continual improvement by correction of vulnerabilities or implementation of improvements. ", "ref_code": "8.5.1", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Monitor and measure the performance of your BCMS.", "description": "The organization not only has to establish and evaluate performance metrics regarding the effectiveness and efficiency of the processes, procedures, and functions that protect its most critical activities, but should also consider metrics for the BCMS performance, regarding compliance with the standard, preventive actions in response to adverse trends, and the degree to which the business continuity policy, objectives, and goals are being achieved. ", "ref_code": "9.1.1", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Evaluation of business continuity procedures ", "description": "The standard recognizes the importance of planned periodic evaluations of business continuity procedures, through exercises, tests, and post-incident reviews, to ensure they are continuously effective, up to date, and fit for purpose to handle the level of risk faced by all key products and services identified. The procedures should also be reviewed regarding compliance with legal and regulatory requirements, as well as their alignment with the business continuity policy and objectives, not only at planned intervals, but after significant changes, so timely adjustments can be made. ", "ref_code": "9.1.2", "system_level": "", "category": "", "subcategory": "", "dti": "easy", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Set up an internal audit program and use it to evaluate BCMS", "description": "Internal audits should be performed at planned intervals, considering the processes’ relevance, and results of previous audits, to ensure compliance with the standard’s requirements and the requirements defined by the organization itself. ", "ref_code": "9.2.1", "system_level": "", "category": "", "subcategory": "", "dti": "easy", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Review the performance of organization's BCMS", "description": "The management review exists so the BCMS can be kept continuously suitable, adequate, and effective to support the business continuity. It must be performed at planned intervals, in a strategic and top management level, covering the required aspects all at once or by parts, in a way that is most suitable to business needs. ", "ref_code": "9.3.1", "system_level": "", "category": "", "subcategory": "", "dti": "moderate", "dtc": "easy", "meta": {}, "subcontrols": []}, {"name": "Identify nonconformities and take corrective actions", "description": "Outputs from management reviews, internal audits, and compliance and performance evaluation should all be used to form the basis for nonconformities and corrective actions. Once identified, a nonconformity or corrective action should trigger, if considered relevant, proper and systematic responses to mitigate its consequences and eliminate root causes, by updating processes and procedures, to avoid recurrence. ", "ref_code": "10.1.1", "system_level": "", "category": "", "subcategory": "", "dti": "hard", "dtc": "moderate", "meta": {}, "subcontrols": []}, {"name": "Enhance the overall performance of BCMS", "description": "Continual improvement is a key aspect of the BCMS, to achieve and maintain the suitability, adequacy, and effectiveness of the business continuity effort as it relates to the organization’s objectives.", "ref_code": "10.2.1", "system_level": "", "category": "", "subcategory": "", "dti": "hard", "dtc": "hard", "meta": {}, "subcontrols": []}]