[{"name": "", "description": "Appoint a person to own and manage the Information Security programme. This person will be referred to as the ‘Security Manager’ within this NIA Manual.", "ref_code": "IG 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Allocate appropriate budget to staff and operate the Information Security Programme.", "ref_code": "IG 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure the Security Manager has a reporting line to the Agency’s risk or internal audit function.", "ref_code": "IG 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that the Agency head provides documented and continuous support for the development, implementation and ongoing maintenance of ICT security processes and infrastructure within their Agency.", "ref_code": "IG 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Where the Agency head delegates their authority to approve variations from requirements in this manual the delegate must have higher authority than the Security Manager.", "ref_code": "IG 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Define information security responsibilities for the Security Manager, management, employees and/or outsourced/3rd party vendors, suppliers or contractors of the Agency.", "ref_code": "IG 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure the Security Manager has:\na. ready access to, and full support from, executive management\nb. familiarity with information security and/or ICT security\nc. a general knowledge of, and experience in, or necessary resources in systems used by the Agency, especially operating systems, access & authorisation control systems/facilities and auditing facilities.\nd. a reasonable capacity and competence to support the Security Manager role.", "ref_code": "IG 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Include the following responsibilities within the Security Manager’s role:\na. identifying and recommending ICT security improvements to all business systems and business processes.\nb. ensuring ICT security aspects are considered as part of the change management process.\nc. ensuring the coordinating of development, maintenance and implementation of all ICT security documentation, in conjunction with the business managers.\nd. ensuring timely reporting and adequate participation in investigation for ICT security incidents, with Q-CERT.", "ref_code": "IG 8", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure the Security Manager is responsible for:\na. ensuring the development, maintenance, updating and implementation of security risk management plans, system security plans and any security procedures used.\nb. providing technical security advice involved with system development, acquisition, implementation, modification, operation, support, and architecture\nc. assisting the system manager to develop system security standards/policies\nd. the certification of systems, when applicable\ne. ensuring the agency has an appropriate ICT security awareness and training program.\nf. the regular review of system security, system audit trails and logs and the integrity of system configurations.", "ref_code": "IG 9", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure the Security Manager is familiar with all security operating procedures relating to systems,including to the roles of system managers, system administrators and system users.", "ref_code": "IG 10", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Define a risk assessment process to identify threats and vulnerabilities to critical information assets (identified with an aggregate security level of Medium or High).", "ref_code": "RM 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Based on the assessment, define a risk treatment plan to address threats and vulnerabilities.", "ref_code": "RM 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that the risk treatment plan and residual risk selected for information assets, with an aggregate security level of High, are vetted by senior management in the Agency.", "ref_code": "RM 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that the controls chosen in RM2 & RM3 are monitored for effectiveness on a periodic basis.", "ref_code": "RM 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Risk assessments should be integrated within the business process and revised whenever there is a change. Changes in the business or legal/regulatory environment may also warrant the need to do risk assessment.", "ref_code": "RM 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The areas or services being outsourced remain the governance, compliance and risk management accountability of the Agency.", "ref_code": "TM 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They understand and acknowledge the risks associated with the outsourcing of their services.", "ref_code": "TM 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "That the security controls and baseline policy specified in this NIA Manual are included in the third party service delivery agreement or contract. This SHALL also apply to sub-contractors used by the third party.", "ref_code": "TM 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The third party SHALL be contractually required to regularly report on the outsourced service’(s) security posture, including any incidents.", "ref_code": "TM 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The services, reports and records provided by the third party should be continuously monitored and reviewed, and audits should be conducted on defined periodic intervals.", "ref_code": "TM 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Serve as a labelling authority for the data and information that it collects or maintains.", "ref_code": "DL 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Rate all information assets in accordance with [IAP-NAT-DCLS]. All assets rated with a Confidentiality rating of C1, C2 or C3 SHALL be suitably marked the data label of Internal, Limited Access or Restricted respectively.", "ref_code": "DL 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "By default, classify information assets as ‘Internal’ unless they are specifically for public release or consumption.", "ref_code": "DL 3", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Establish the data labelling system to support the “Need-To-Know” requirement, so that information will be protected from unauthorized disclosure and use.", "ref_code": "DL 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Establish data labelling education and awareness for its staff, employees and contractors.", "ref_code": "DL 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Define and adhere to a documented change management process which may include the following or similar change categories:\na. Planned Major Change. Examples of planned major changes are:\n• Change that results in business interruption during regular business hours\n• Change that results in business or operational practice change\n• Changes in any system that affects disaster recovery or business continuity\n• Introduction or discontinuance of an information technology service\nb. Maintenance and Minor Changes. Examples of this type of change are:\n• Application level security changes/patches\n• Operating system patches (critical, hotfixes, and service packs)\n• Regularly scheduled maintenance\n• Changes that are not likely to cause a service outage\nc. Emergency and Unplanned Outage Changes. Examples of this type of change are:\n• A severe degradation of service needing immediate action\n• A system/application/component failure causing a negative impact on business operations\n• A response to a natural disaster\n• A response to an emergency business need\n• A change requested by emergency responder personnel", "ref_code": "CM 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Establish a cross functional Change Management Committee which must include representation from security and risk divisions", "ref_code": "CM 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Document and Approve all proposed changes through the relevant Change Management Committee.", "ref_code": "CM 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that upon implementing any proposed change that may impact the security of the ICT system assess whether the system will require re-certification. The system MUST comply with baseline requirements at minimum even after change implementation. Risk analysis may be required to ensure residual risk at acceptable level.", "ref_code": "CM 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "All associated system documentation is updated to reflect the change.", "ref_code": "CM 5", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Emergency changes may be carried out on the basis of a verbal/informed approval from the Change management committee Head and the Business process owner. However, post emergency, the\nstandard procedure for documenting and risk analysis is to be applied.", "ref_code": "CM 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that the Human Resources (HR) processes are aligned with information security policies and initiatives of the organization.", "ref_code": "PS 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure the HR department documents security requirements and obligations and ways of working in HR manual, which is read, understood and available to all staff to ensure they are aware and comply with their obligations to information security.", "ref_code": "PS 2", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Obtain, manage and retain information related to personnel with due care and due diligence, in line with the requirements for handling Personal Information as specified in the proposed information Privacy and Protection Law.", "ref_code": "PS 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure information security responsibilities are included as part of the employees’ job responsibilities and job descriptions and are applied throughout an individual’s employment within the organization.\n", "ref_code": "PS 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Conduct adequate screening to ascertain the integrity of prospective candidates for employment and contractors (including sub-contracted workers).", "ref_code": "PS 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that staff sign an agreement, on joining the Agency or when there is a changein job profile or duties, which outlines their security obligations and responsibilities. This SHALL include:                                         a. Confidentiality and non-disclosure obligations.", "ref_code": "PS 6", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that adequate controls are in place to prevent personnel (employees, vendors, contractors and visitors) from making unauthorized disclosures, misusing or corrupting information as per\nAgency security policies.", "ref_code": "PS 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that users access rights are restrictive to the information they need to fulfill their job requirements as per least privilege and need to have principles.", "ref_code": "PS 8", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Implement a split of responsibilities over sensitive security processes and tasks, using the four eyes principles to ensure knowledge sharing and to avoid a single individual having full control over critical processes or tasks.", "ref_code": "PS 9", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Define, communicate and enforce a disciplinary process and ensure that employees are made aware of the process. Disciplinary processes SHOULD be documented in the employee or HR manual.", "ref_code": "PS 10", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that vendors, contractors, delegates or guests visiting Agency premises are:\na. Logged with unique identifiable information including date, time and purpose of admittance.\nb. Provided with a visitor badge or identification tag.\nc. Wearing a noticeable sign displaying their status as “visitor” at all times.\nd. Made aware of their obligations in complying with the security policies of the Agency.\ne. Escorted by Agency employees while accessing secure areas.", "ref_code": "PS 11", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that a change request from the HR department is generated when a change of duties or termination of contract of an employee, contractor or third party occurs. This ensures that employees, contractors and third parties return Agency assets and physical & logical\naccess are amended/removed as appropriate.", "ref_code": "PS 12", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "A security awareness programme is defined and adequate budgets are allocated for its implementation.", "ref_code": "SA 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "As a minimum, such training includes\na. Baseline requirements specified in this NIA Manual\nb. Agency’s security requirements\nc. Legal and regulatory responsibilities\nd. Business specific processes and controls\ne. Acceptable use of information processing facilities, (e.g. log-on procedures, use of software packages, etc.)\nf. Information on the enforcement and disciplinary process\ng. Information on who to contact for further security advice and the proper channels for reporting information security incidents.", "ref_code": "SA 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "All employees of the Agency and, where relevant, contractors and third party users receive appropriate security awareness training regarding the Agency’s policies and  procedures, as relevant for their job function, roles, responsibilities and skills.", "ref_code": "SA 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Employees should be trained to recognize social engineering attempts on them and not disclose any information that could violate the Agency’s security policies, such as during social gatherings, public events and training events.\n", "ref_code": "SA 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Contents of the security training and awareness are reviewed and updated regularly to reflect new trends, new threats, and changes to the Agency’s information technology infrastructure or applicable laws and regulations.", "ref_code": "SA 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "New employees are provided information security awareness training as part of the employee induction process and refresher training must be conducted on periodic basis.", "ref_code": "SA 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Training is followed up with an assessment, to ascertain the effectiveness of the programme, including maintaining of records of attendance of security awareness programmes.", "ref_code": "SA 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Indirect media such as posters, intranet, email, etc. may be used effectively to support the awareness programme.", "ref_code": "SA 8", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Appoint a person to own and manage the Incident Management programme, including a point of contact for all information security communications.", "ref_code": "IM 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Establish an information security incident response capability, based on the [IAP-NAT-DCLS] which is capable of making a periodic risk assessment (from threat, vulnerability and asset value) of data,\nprocesses, systems and networks in accordance with this Information Assurance Manual.", "ref_code": "IM 2", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "Define procedures to detect, evaluate and respond to incidents.\n", "ref_code": "IM 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Define procedures to report, manage and recover from information security incidents, internally, with Q-CERT and with other Agencies.", "ref_code": "IM 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Create awareness amongst its staff to report incidents.", "ref_code": "IM 5", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Categorise and prioritize all incidents according to the incident criticality classification provided in Appendix C.", "ref_code": "IM 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Co-ordinate with Q-CERT to create a repository of incidents in the Agency.", "ref_code": "IM 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Report all Criticality Level 1 incidents to Q-CERT within one (1) hour of identification.", "ref_code": "IM 8", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Incident Management coordinator is responsible for developing and executing an annual Security Assurance Plan. This may include activities such as penetration testing, audit of security procedures, and incident scenario testing.", "ref_code": "IM 9", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "A person is appointed to own and manage the Business Continuity Programme.", "ref_code": "BC 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "A Business Continuity (BC) Plan is prepared to ensure continuance of critical processes and the delivery of essential services to an acceptable level. This plan SHALL include, and be based on Recovery Time Objectives (RTO) and Recovery Point Objectives (RPO) for each Agency process.", "ref_code": "BC 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The BC Plan covers disaster scenarios possible and adequate and includes disaster recovery provisions.", "ref_code": "BC 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The BC Plan is maintained and updated to reflect the current status and requirements and relevant information is made available for all team members, employees and service providers.", "ref_code": "BC 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "A copy of the up to date BC Plan along with the necessary backup data tapes media and information is stored in a fire/tamper proof safe, along with an additional copy stored in an off-site location. Best practices state that offsite location must be in a geographically different zone than the primary data centre.", "ref_code": "BC 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They identify alternate disaster recovery sites, whose readiness is determined by the RTO requirements. These sites may be Hot/Warm/Cold Sites depending upon the Agency’s requirements.", "ref_code": "BC 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They specify strong controls in contracts that involve outsourcing a portion of their business or information technology functions or business continuity services.", "ref_code": "BC 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The BC Plan is periodically tested at least on an annual basis or when significant changes take place in the business or legal/regulatory requirements.", "ref_code": "BC 8", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Awareness about the BC plan is created amongst its employeess.", "ref_code": "BC 9", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Adequate set of technical control implementations, or processes exist for logging, identification and continuous monitoring of access, changes, command execution to, any/ all information assets for protection of business sensitive information.", "ref_code": "SM 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Monitoring practices are established in accordance with criticality of the infrastructure , data, and applications. It is RECOMMENDED to provide a 24/7 monitoring for C3, I3 and A3 classified infrastructures and ensure that monitoring responsibilities are allocated as specified in clause PS9, section B- 6, Personnel Security [PS].", "ref_code": "SM 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Monitoring activity is in line with regulatory and legal frameworks such as the proposed Information Privacy & Protection Law and SHALL cover use or access to systems.", "ref_code": "SM 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They enable logging on all infrastructure and data processing equipment, and applications that are associated with the access, transmission, processing, security, storage, and/or handing of information classified with a confidentiality rating of C2 and above.", "ref_code": "SM 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They classify all security logs with a confidentiality rating of C3, while application and system logs SHALL be classified in accordance with the confidentiality rating of the system.", "ref_code": "SM 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Logs containing Personal Information have appropriate privacy protection measures in place, in accordance with the Proposed Information Privacy & Protection Legislation.", "ref_code": "SM 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "These logs are retained for a minimum of ninety (90) days and a maximum depending on criticality assessments and sector specific laws and regulations.", "ref_code": "SM 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Agency’s MUST enable audit logging or log capture, to record date, time, authentication activity with unique user and system identifiers, including all failure or change actions, further including commands issued and output generated to provide enough information to permit reconstruction of incidents and move system to its original state.", "ref_code": "SM 8", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Exceptions are identified and reported in accordance with the Incident Handling policy, as defined in section B- 8, Incident Management [IM].", "ref_code": "SM 9", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They determine and document the retention periods of suitable information assets including but not limited to the critical information assets that they hold. Data retention periods SHALL, at a minimum, be governed by:\na. Agency policies & needs\nb. Regulatory requirements\nc. Legal requirements", "ref_code": "DR 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Data, which needs to be retained, is stored ensuring confidentiality, integrity and availability and that it can be accessed for defined future purposes.", "ref_code": "DR 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Personal and sensitive Information is not retained for longer than it is necessary as per the Proposed Information Privacy & Protection Legislation.", "ref_code": "DR 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Processes for backup, archival and recovery of data have corresponding procedures which ensure that the integrity and confidentiality of the data is retained.", "ref_code": "DR 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Archived data retains it classification markings and is secured accordingly.", "ref_code": "DR 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The archiving technology deployed is regularly reviewed to ensure that it does not suffer from obsolescence and archived data is maintained in a state that allows successful recovery.", "ref_code": "DR 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Produce a Agency security policy, incorporating the requirements of this NIA Manual.", "ref_code": "DC 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that every system that is determined to be critical to the Agency is covered by a system security plan/standard. Agencies SHOULD ensure that, where necessary, security operating procedures are created and documented.", "ref_code": "DC 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure system security standards and procedures are aligned and consistent with the Agency’s security policies and objectives.", "ref_code": "DC 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "By default, classify ICT security documentation as a minimum of C3/RESTRICTED", "ref_code": "DC 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Review and update documentation periodically to ensure that they are up to date and current.", "ref_code": "DC 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure the establishment of a governance and security improvement programme in compliance with the National Information Classification Policy [IAP-NAT-DCLS] and this NIA Manual.", "ref_code": "AC 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Comply with relevant provisions of State Laws and regulations that exist at the time and those, which may be amended and / or added at a later date in time.", "ref_code": "AC 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Be audited by the Certification Body or an independent body designated by MOTC.", "ref_code": "AC 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that an audit of its Information System (infrastructure, people and processes) is carried out at least once every year or whenever it undergoes a change that may impact the security of the Agency.", "ref_code": "AC 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that the identified scope of the audit process includes all information assets, people and processes.", "ref_code": "AC 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that recertification is carried out where any change or new finding invalidates or calls into question the current accreditation. Full certification is required for major changes affecting the basic security design of a system and a partial process is needed where the change is moderate or affects two or more security requirements.", "ref_code": "AC 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that all non-conformance is fixed in a defined timeline.", "ref_code": "AC 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that any exemptions are approved by the Certification Body.", "ref_code": "AC 8", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Conduits (tubes, ducts or pipes) are used to protect cables from tampering, sabotage or accidental damage, when they are carrying data classified at C4 and above. This control is RECOMMENDED for data classified at C2 and above.", "ref_code": "CS 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Separate cabling distribution is used for systems dealing with information classified at C4 and above", "ref_code": "CS 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Conduits installed in public or visitor areas are not labelled in a manner that attract undue attention by people who may not have the appropriate security clearances or a need-to-know of the existence of such cabling", "ref_code": "CS 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They maintain a register of cables. The register SHOULD record at least the following:\na. cable identification number,\nb. classification,\nc. source,\nd. destination, and\ne. floor plan diagram.", "ref_code": "CS 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Inspect cables for inconsistencies with the cable register on a regular basis", "ref_code": "CS 5", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Agency’s MAY provision for redundant communication pathways to ensure continued connectivity.", "ref_code": "CS 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Advise users of the maximum permitted classification level for conversations of both internal and external telephone connections, as determined by the examination of the internal telephone system and the level of the encryption, if any, on external connections", "ref_code": "CS 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that the speakerphone feature is disabled during telephonic/video conversations where information classified at C3 or above is likely to be discussed and where it may be overheard.", "ref_code": "CS 8", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that remote initiation of conferencing equipment is not enabled where it is installed in a sensitive location.", "ref_code": "CS 9", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that rooms designated for communication of sensitive material or information or meetings have appropriate controls for preventing the leakage of sound.", "ref_code": "CS 10", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that fax machines on both ends are secured using encryption devices, while sending information classified as C2 and above.", "ref_code": "CS 11", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that all of the standards for the use of fax machines are met at both ends for the level of classification to be sent, and the sender makes arrangements for the receiver to:\na. collect the information from the fax machine as soon as possible after it is received, and\nb. notify the sender if the fax does not arrive within an agreed amount of time, e.g. 10 minutes.", "ref_code": "CS 12", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Details of internal network and system configuration, employee or device related directory services and other sensitive technology are not publicly disclosed or enumerable by unauthorized personnel.", "ref_code": "NS 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "They remove or disable all the default accounts e.g. root, administrator, etc. or change the password as specified in section C-6, Software Security [SS].", "ref_code": "NS 2", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Network configuration is kept under the control of the network manager or similar and all changes to the configurations are:\na. approved through a formal change control process as defined in section B- 5, Change Management [CM]\nb. documented, and comply with the network security policy and security plan as defined in section B- 12, Documentation [DC].\nc. regularly reviewed. Old configurations as mandated by the Agency’s procedures are maintained as part of change revision. The frequency of reviewing configuration shall depend on the Agency risk and processes.", "ref_code": "NS 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "For each managed network the Agency has:\na. a high level diagram showing all connections into the network, and\nb. a logical network diagram showing all network devices.\nc. processes to update NS4 (a) & (b), as network changes occur\nd. include a “Current at <date>” label on each page.", "ref_code": "NS 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Networks are designed and configured to limit opportunities of unauthorized access to information transiting the network infrastructure. Agencies SHOULD use the following technologies to meet this requirement:\na. switches instead of hubs,\nb. port security on switches to limit access and disable all unused ports\nc. routers and firewalls segregating parts of the network on a need-to-know basis,\nd. IPSEC/IP Version 6\ne. application-level encryption\nf. an automated tool that compares the running configuration of network devices against the documented configuration\ng. network edge authentication\nh. Restrict and manage end-user devices communicating to Agency network through techniques such as MAC address filtering.\ni. IPS/IDS to detect/prevent malicious activity within the network\nj. Time and day restriction.", "ref_code": "NS 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Management networks adopt the following protection measures:\na. dedicated network are used for management devices, i.e. implement a separate management VLAN, or physically separate infrastructure,\nb. secure channels e.g. by using VPNs, SSH, etc.", "ref_code": "NS 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "VLANs are used to separate IP telephone traffic, in business critical networks.", "ref_code": "NS 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Administrative access is only permitted from the most highly classified VLAN to one at the same level of classification or of lower classification.", "ref_code": "NS 8", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They implement all security measures recommended by the agency’s risk assessment and the hardening guidelines by the vendor of the switch.", "ref_code": "NS 9", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Trunking/port mirroring SHALL not be used on switches managing VLANs of differing classifications.", "ref_code": "NS 10", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Network-connected MFDs are not used to copy documents classified above the level of the connected network", "ref_code": "NS 11", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Where network-connected MFDs have the ability to transmit information via a gateway to another network, agencies MUST ensure that:\na. each MFD applies user identification, authentication and audit functions for all information transmitted by users from that MFD,\nb. these mechanisms are of similar strength to those required for workstations on that network, and\nc. *the gateway can identify and filter the information in accordance with the requirements for the export of data.", "ref_code": "NS 12", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "There is no direct connection from an MFD to a telephone network of a lower classification unless the MFD has been evaluated, and the scope of the evaluation includes:\na. information flow control functions to prevent unintended and unauthorized data flows,\nb. data export controls capable of blocking information based on information classification,\nc. authentication, and audit data generation and protection,", "ref_code": "NS 13", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "They deploy MFDs after developing a set of policies, plans and procedures governing the use of the equipment.", "ref_code": "NS 14", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Information classified at C1 or above is not retained permanently in the MFD. Where the MFD has features to schedule jobs, sufficient manual/automatic controls or configurations SHALL exist to remove the information from its memory once the job is complete.", "ref_code": "NS 15", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "MFDs follow the procedures specified in section C, 8.3, Media Sanitization.", "ref_code": "NS 16", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "A separate internal DNS server is set up and placed in the internal network for internal domain information that is not disclosed to the Internet.", "ref_code": "NS 17", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "DNS information that should be made public either has a locally hosted and secured (bastion server) server. State Agencies may also use the Government DNS which is part of the Government Network as the Primary DNS.", "ref_code": "NS 18", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "DNS servers are deployed to ensure there is no single points of failure in their service, they are security-hardened and security is proactively maintained.", "ref_code": "NS 19", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Zones files are digitally signed, and cryptographic mutual authentication and data integrity of zone transfers and dynamic updates is provided.", "ref_code": "NS 20", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Cryptographic origin authentication and integrity assurance of DNS data is provided.", "ref_code": "NS 21", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "DNS services including zone transfers are provided to authorized users only.", "ref_code": "NS 22", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Cryptographic functions related to NS 20 and NS 21 above, use a hardware security module for both key management and cryptographic processing as specified in section C- 10, Cryptographic Security [CY].", "ref_code": "NS 23", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "All software and files downloaded from the Internet are screened and verified against malicious software, including mechanisms to scan HTTP traffic.", "ref_code": "NS 24", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The Internet gateway denies all Internet services unless specifically enabled.", "ref_code": "NS 25", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Web browsers running on user’s workstation are properly configured and updated. Agencies SHOULD reference the following guidelines when configuring web browsers:\na. Disable any active content options, e.g. Java, JavaScript and ActiveX, in the email application/browser, except when communicating with a trusted source\nb. Use up-to-date browser versions and apply latest security patches\nc. Disable password auto-complete/password remembering features\nd. Enable pop-up blocking features, except when communicating with trusted sites\ne. Regularly remove cache files or temporary files of the browsers to protect data privacy\nf. Disable automatic installation of plug-ins, add-ons or software", "ref_code": "NS 26", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They have the capability needed to monitor the traffic, deduce traffic patterns, usage etc. See section B- 10, Logging & Security Monitoring [SM] for more information.", "ref_code": "NS 27", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "E-mail servers are hardened as per best practices and configured as a bastion server. If technically and operationally feasible, information revealing the specific details of internal systems or configurations MUST be avoided in email headers to avoid the disclosure of system information to external parties.", "ref_code": "NS 28", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "TLS protection is used with the SMTP Mail server in line with section C-10, Cryptographic Security [CY].", "ref_code": "NS 29", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They implement the email Sender Policy Framework (SPF) [RFC4408]. Agencies SHOULD only send undeliverable or bounce emails to senders that can be verified via SPF", "ref_code": "NS 30", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Internal email distribution lists are secured to prevent access from external parties to reduce the risk of unsolicited email.", "ref_code": "NS 31", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Email gateways are employed to scan all incoming and outgoing emails to ensure it complies with the Agency’s security policy and that it is free of any malicious code.", "ref_code": "NS 32", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Where wireless LANs (WLANs) are used, they are used with sufficient authentication and transmission encryption measures in place, complemented by proper security management processes and practices.", "ref_code": "NS 33", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Strong wireless security protocols such as WPA2 and EAP-TLS are used. However, such wireless security protocol should not be solely relied upon to protect data confidentiality and integrity. Agency SHALL deploy dynamic key exchange mechanisms, secure Virtual Private Network (VPN) on top of wireless network if classified data, C3 and above, is to be communicated over wireless networks. WEP SHALL NOT be implemented within any network.", "ref_code": "NS 34", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "A good inventory of all devices with wireless interface cards is maintained. Once a device is reported missing, consider modifying the encryption keys and SSID.", "ref_code": "NS 35", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Network administrators regularly scan for “rouge” or “unauthorized” wireless access points.", "ref_code": "NS 36", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Access points are located to minimize network tapping from publicly accessible area.", "ref_code": "NS 37", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The client side settings for 802.1x MUST be secured. Some of the techniques are: server certificate validation by selecting the CA certificate, specify the server address and disable it from prompting users to trust new certificates or servers.", "ref_code": "NS 38", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The network default name, encryption keys and Simple Network Management Protocol (SNMP) community strings (and any insecure configuration) is changed at installation. SSID SHALL NOT reflect the name of any Agency’s departments, system name or product name.", "ref_code": "NS 39", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "For non-public wireless access points, encryption keys are regularly changed and SSID broadcasting is disabled. Where applicable MAC address filtering SHOULD also be considered.", "ref_code": "NS 40", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "A firewall or router is in place between the access point and the Agency’s network to filter connections. Restricted firewall rules MUST be applied to allow only needed ports to pass from the wireless segment.", "ref_code": "NS 41", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "WIPS/WIDS installation is recommended for networks with C3+ to monitor threats from wireless installations like rouge Aps, DOS attacks, etc.", "ref_code": "NS 42", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Use multiple SSIDs with different configurations for different VLANs, client authentication methods, etc. For example, contract staff or guest may use a different WIFI connections. Guest WIFI may have lower security and may only allow for connecting to the internet.", "ref_code": "NS 43", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "NTP servers MUST be secured as per best practices.", "ref_code": "NS 44", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Where a computer or communications device has the capability to operate a real-time clock, it shall be set to an agreed standard, e.g., Universal Coordinated Time (UTC) or local standard time. As some clocks are known to drift with time, there shall be a procedure that checks for and corrects any significant variation.", "ref_code": "NS 45", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "State Agency’s MAY use the authorized Qatari Government time server (a part of the Government Network) as the primary NTP server.", "ref_code": "NS 46", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "All servers and network devices are synchronized with the local Agency NTP server which is synchronized as specified in NS45 and NS46.", "ref_code": "NS 47", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "VPNs carrying classified data at C3 or above, SHALL authenticate using two-factor authentication :\n• first one a one-time password authentication such as a token device or a public/private key system with a strong passphrase\n• Second username and password using external authenication server (LDAP,Radius , TACACS.etc.)", "ref_code": "NS 48", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "VPNs disconnect automatically from Agency’s network after a pre-defined period of inactivity. The user SHALL be required to logon again to reconnect to the network.", "ref_code": "NS 49", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Dual (split) tunneling is not permitted unless suitable controls are in place. Agencies SHOULD only permit one network connection at a time.", "ref_code": "NS 50", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "All computers connected to a Agency’s networks via VPN are equipped with personal security software, latest security patches, anti-virus software and malicious code detection and repair software. This security software SHALL be activated at all time and with the latest virus signatures and malicious code definitions.", "ref_code": "NS 51", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Gateway-level firewalls are installed to control network traffic from VPN clients to authorized information systems or servers.", "ref_code": "NS 52", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Voice and data are separate networks. The separation SHOULD be physical, but use of Virtual LANS is permitted. The voice gateway, which interfaces with the PSTN segregates H.323, SIP, or other VoIP protocols from the data network.", "ref_code": "NS 53", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "VoIP capable gateways and other appropriate security mechanisms are employed.", "ref_code": "NS 54", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They evaluate and use security enabled protocols such as Secure Real Time Protocol (SRTP) and disable unnecessary voice protocols.", "ref_code": "NS 55", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Proper physical counter measures are in place to protect the VoIP infrastructure.", "ref_code": "NS 56", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Adequate call log monitoring is implemented.", "ref_code": "NS 57", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Soft-phones, if permitted are through a secure connection. e.g. secure VPN.", "ref_code": "NS 58", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Backup power is provided to POE VoIP phone devices in case of failure of power.", "ref_code": "NS 59", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Strong authentication and access controls are implemented to protect the voice gateway system.", "ref_code": "NS 60", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "IPSEC or Secure Shell (SSH) is used for all remote management and auditing access.", "ref_code": "NS 61", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Contingency plans for making voice calls are developed if VoIP systems become unavailable.", "ref_code": "NS 62", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Port security features are enabled on the network LAN switches that connect VoIP devices.", "ref_code": "NS 63", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "A proper risk assessment is conducted by the Agency to assess the security merits and demerits of IPv4 and IPv6 technology. Agencies SHOULD start considering IPv6 deployment.", "ref_code": "NS 64", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "A proper risk assessment is conducted if the Agency decided to implement a dual-stack environment.", "ref_code": "NS 65", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Recertification is requested where Agencies deploy IPv6 in their network.", "ref_code": "NS 66", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Prior to establishing cross-domain connectivity, the Agency evaluates, understands and accepts the structure, security and risks of other domains. This risk review SHALL be documented for compliance requirements.", "ref_code": "IE 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "When intending to connect an agency network to another secured network, they:\na. obtain a list of networks to which the other network is connected from the other network’s Accreditation, Authority and System Manager,\nb. examine the information from both sources to determine if any unintended cascaded connections exist, and\nc. consider the risks associated with any identified cascaded connections prior to connecting the agency network to the other network, particularly where a connection to an un-trusted network\nsuch as the internet may exist.", "ref_code": "IE 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure that necessary agreements (specifically confidentiality agreements) between the entities exchanging information have been established prior to information exchange. Agreements SHALL provide information on responsibilities, information exchange notification procedure, technical standards for transmission, identification of couriers, liabilities, ownership and controls. For vendors and 3rd parties a formal Non-Disclosure Agreement (NDA) SHALL be used. Appendix D provides a NDA template.", "ref_code": "IE 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure media which is used to exchange information is protected against unauthorized access, manipulation or misuse within or outside the Agency environment.", "ref_code": "IE 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Maintain the classification and protection of information that has been obtained from another Agency.", "ref_code": "IE 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Maintain appropriate levels of physical protection for media in transit and store in packaging that protects it against any hazard that would render the content unreadable.", "ref_code": "IE 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure only reliable and trusted courier service or transport organization SHALL be used based on a list of known and authorized couriers.", "ref_code": "IE 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Protect information exchanged via electronic messaging from unauthorized access, change or interruption of service.", "ref_code": "IE 8", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure secure messaging (information is digitally signed and/or encrypted) is used for all information classified at C3 or above. Agencies SHALL use Secure Multipurpose Internet Mail Extension (S/ MIME), equivalent or better protocol for secure messaging as specified in clause CY5, section C- 10, Cryptographic Security [CY].", "ref_code": "IE 9", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Attach the following email disclaimer, or similar, to all outgoing email:\n“The information in this email, including attachments, may contain information that is confidential, protected by intellectual property rights, or may be legally privileged. It is intended solely for the\naddressee(s). Access to this email by anyone else is unauthorized. Any use, disclosure, copying,or distribution of this email by persons other than the designated addressee is prohibited. If youare not the intended recipient, you should delete this message immediately from your system. If you believe that you have received this email in error, please contact the sender or < Agency’s name & contact information>. Any views expressed in this email or its attachments are those of the individual sender except where the sender, expressly and with authority, states them to be the views of < Agency>.”\n", "ref_code": "IE 10", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Exercise due diligence to ensure that any information sent/received is free of viruses, trojans and other malicious code", "ref_code": "IE 11", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure information exchanged between systems is secured against misuse, unauthorized access or data corruption. For transmitting information classified at C2, I2 or above, authenticated and encrypted channels SHALL be used as specified in CY5, section C- 10, Cryptographic Security [CY].", "ref_code": "IE 12", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "Limit the information provided to the general public (via media outlets), to sanitized and approved information, through a designated and trained media relation spokesperson.", "ref_code": "IE 13", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Networks are protected from other networks by gateways and data flows are properly controlled", "ref_code": "GS 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Gateways connecting Agency networks to other Agency networks, or to uncontrolled public networks, are implemented:\na. with an appropriate network device to control data flow\nb. with all data flows appropriately controlled\nc. with gateway components physically located within an appropriately secured server room.", "ref_code": "GS 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Only authorized and trained staff manage and maintain gateways", "ref_code": "GS 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Administrative or management access to gateways processing or transmitting information classified at C3 or above is only provided based on dual control and the four eyes principles.", "ref_code": "GS 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "Information exchanged through gateways is labelled as per the National Information Classification policy [IAP-NAT-DCLS] and protected as specified in this document. Gateways SHALL be classified inline with the information they are transmitting.", "ref_code": "GS 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Demilitarized zones (DMZs) are used to separate externally accessible systems from uncontrolled public networks and internal networks via usage of firewalls and other network security capable equipment", "ref_code": "GS 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Gateways:\na. are the only communications paths into and out of internal networks\nb. by default, deny all connections into and out of the network\nc. allow only explicitly authorised connections\nd. are managed via a secure path isolated from all connected networks\ne. provide sufficient audit capability to detect gateway security breaches and attempted network\nintrusions\nf. provide real-time alarms.", "ref_code": "GS 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Gateways are hardened prior to any implementation on production site and are protected against:\na. Malicious code and vulnerabilities\nb. Wrong or poor configurations\nc. Account compromise and privilege escalation\nd. Rogue network monitoring\ne. Denial of service (DoS) attacks\nf. Information/data leakage", "ref_code": "GS 8", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Monitoring and supervision of gateways is in place and include threat prevention mechanisms, logging, alerts and surveillance of equipments. Section B- 10, Logging & Security Monitoring [SM].", "ref_code": "GS 9", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Gateways block or drop any data identified by a content filter as suspicious, including at least the following:\na. Offensive language or attachments\nb. Malware infected content\nc. DoS attacks\nd. Categories of website/content defined as inappropriate in the proposed Cyber Crime Law including sites hosting obscene material, gambling sites, etc.", "ref_code": "GS 10", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "System users:\na. are held accountable for the data they export\nb. are instructed to perform a protective marking check, a visual inspection and a metadata check if relevant on whether the information can be exported", "ref_code": "GS 11", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Data exports are either:\na. performed in accordance with processes and/or procedures approved by the Agency; or\nb. individually approved by the information security manager.", "ref_code": "GS 12", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Export of data to a less classified system is restricted by filtering data using at least checks on classification labels.", "ref_code": "GS 13", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Data exports are checked, ensuring:\na. keyword searches are performed on all textual data\nb. any unidentified data is quarantined until reviewed and approved for release by a trusted source other than the originator", "ref_code": "GS 14", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "System users:\na. are held accountable for the data they import\nb. are instructed to perform a protective marking check, a visual inspection and a metadata check if relevant.", "ref_code": "GS 15", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Data imports are either:\na. performed in accordance with processes and/or procedures approved by the Agency; or\nb. individually approved by the information security manager.", "ref_code": "GS 16", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Data imported to a Agency system is scanned for malicious and active content.", "ref_code": "GS 17", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The process for product selection is carried out with due diligence and ensures product and vendor independence.", "ref_code": "PR 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Products are classified and labeled as per National Information Classification policy [IAP-NATDCLS].", "ref_code": "PR 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The selection process includes proper identification of vendor, screening of vendors and evaluation criteria definition which should include as a minimum:\na. Vendor status and identification, including location and ownership\nb. Financial situation\nc. References from previous successful engagements\nd. The ability of the vendor to build and/or maintain appropriate controls as determined by a risk assessment", "ref_code": "PR 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Proper testing and effective matching between vendor’s claim and functionality is carried out, to avoid loss of confidentiality, integrity and/or availability.", "ref_code": "PR 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Security evaluation of the product is done on a dedicated evaluation configuration including functionality tests, security tests and patching to protect against potential threats and vulnerabilities.", "ref_code": "PR 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Delivery of products is consistent with the Agency’s security practice for secure delivery.", "ref_code": "PR 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Secure delivery procedures SHALL include measures to detect tampering or masquerading.", "ref_code": "PR 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Products have been purchased from developers that have made a commitment to the ongoing maintenance of the assurance of their product.", "ref_code": "PR 8", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Product patching and updating processes are in place. Updates to of products SHALL follow the change management policies specified in section B- 5, Change Management [CM].", "ref_code": "PR 9", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Security is considered in all phases of the SDLC and that it is an integral part of all system development or implementation project.", "ref_code": "SS 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "All applications (including new and developed) are classified using the National Information Classification Policy [IAP-NAT-DCLS] and accorded security protection appropriate to its Confidentiality, Integrity and Availability ratings.", "ref_code": "SS 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Security requirements (functional, technical and assurance requirements) are developed and implemented as part of system requirements.", "ref_code": "SS 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Dedicated test and development infrastructure (systems and data) are available and is separate from production systems. Furthermore, information flow between the environments SHALL be strictly limited according to a defined and documented policy, with access granted only to system users with a clear business requirement and write access to the authoritative source for the software SHALL be disabled.", "ref_code": "SS 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "All applications (acquired and/or developed) are available for production use only after appropriate quality and security assurance tests and checks to ensure that the system confirms and complies with the intended security requirements.", "ref_code": "SS 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Software developers use secure programming practices when writing code, including:\na. complying with best practices, for example the Mitre top 25 most dangerous programming errors [Mitre]\nb. designing software to use the lowest privilege level needed to achieve its task\nc. denying access by default\nd. checking return values of all system calls\ne. validating all inputs.\n", "ref_code": "SS 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Software should be reviewed and/or tested for vulnerabilities before it is used in a production environment. Software SHOULD be reviewed and/or tested by an independent party and not by the developer.", "ref_code": "SS 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "System (acquired and/or developed) complies with all legal requirements including license, copyrights, IPR etc.", "ref_code": "SS 8", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "All systems (acquired and/or developed) are adequately documented.", "ref_code": "SS 9", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Source code of custom developed critical applications is available and in the case of commercial applications (serving critical applications / processes) a Agency SHOULD look into options of arranging an escrow for the source code.", "ref_code": "SS 10", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Prior to commissioning of applications, they are certified as specified in section B- 13, Audit & Certification [AC].", "ref_code": "SS 11", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "All server and workstation security objectives and mechanisms are documented in the relevant system security plan.", "ref_code": "SS 12", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Workstations use a hardened standard operating environment (SOE) covering:\na. removal of unwanted software\nb. disabling of unused or undesired functionality in installed software and operating systems\nc. implementation of access controls on relevant objects to limit system users and programs to the minimum access needed to perform their duties\nd. installation of software-based firewalls limiting inbound and outbound network connections\ne. configuration of either remote logging or the transfer of local event logs to a central server", "ref_code": "SS 13", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Potential vulnerabilities in their SOEs and systems are reduced by:\na. removing unnecessary file shares\nb. ensuring patching is up to date\nc. disabling access to all unnecessary input/output functionality.\nd. removing unused accounts\ne. renaming default accounts\nf. replacing default passwords.", "ref_code": "SS 14", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "High risk servers e.g. Web, email, file and Internet Protocol telephony servers, etc. having connectivity to uncontrolled public networks:\na. maintain effective functional separation between servers allowing them to operate independently\nb. minimise communications between servers at both the network and file system level, as appropriate\nc. limit system users and programs to the minimum access needed to perform their duties.", "ref_code": "SS 15", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Check the integrity of all servers whose functions are critical to the Agency, and those identified as being at a high risk of compromise. Wherever possible these checks SHOULD be performed from a trusted environment rather than the system itself.", "ref_code": "SS 16", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Store the integrity information securely off the server in a manner that maintains integrity", "ref_code": "SS 17", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Update the integrity information after every legitimate change to a system", "ref_code": "SS 18", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "As part of the Agency’s ongoing audit schedule, compare the stored integrity information against current integrity information to determine whether a compromise, or a legitimate but incorrectly completed system modification, has occurred", "ref_code": "SS 19", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Resolve any detected changes in accordance with the Agency’s information and communications technology (ICT) security incident management procedures.", "ref_code": "SS 20", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "All software applications are reviewed to determine whether they attempt to establish any external connections. If automated outbound connection functionality is included, Agencies SHOULD make a business decision to determine whether to permit or deny these connections, including an assessment of the risks involved in doing so.", "ref_code": "SS 21", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "All active content on their Web servers is reviewed for security issues. Agencies SHOULD follow the documentation provided in the Open Web Application Security Project (OWASP) guide to building secure Web applications and Web services.", "ref_code": "SS 22", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Connectivity and access between each Web application component is minimised.", "ref_code": "SS 23", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "That Personal Information and sensitive data is protected whilst in storage and in transmission using appropriate cryptographic controls", "ref_code": "SS 24", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Critical sector websites that need to be strongly authenticated, use SSL certificates provided from a Certificate Service Provider (CSP) licensed in the State of Qatar.", "ref_code": "SS 25", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Web application firewall (WAF) MUST be used for applications with MEDIUM or higher risk rating.", "ref_code": "SS 26", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "All information stored within a database is associated with an appropriate classification if the information:\na. could be exported to a different system, or\nb. contains differing classifications and/or different handling requirements.", "ref_code": "SS 27", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Agencies should ensure that classifications are applied with a level of granularity sufficient to clearly define the handling requirements for any information retrieved or exported from a database.", "ref_code": "SS 28", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Database files are protected from access that bypasses the database’s normal access controls.", "ref_code": "SS 29", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Databases provide functionality to allow for auditing of system users’ actions.", "ref_code": "SS 30", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "System users who do not have sufficient privilege to view database contents cannot see associated metadata in a list of results from a search engine query. If results from database queries cannot be appropriately filtered, agencies MUST ensure that all query results are appropriately sanitized to meet the minimum-security privilege of system users.", "ref_code": "SS 31", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Sensitive data in database shall be masked using data masking technology for C3 & above.", "ref_code": "SS 32", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "System users SHALL be responsible for the information assets (systems / infrastructure) provided to them to carry out their official responsibilities. They SHALL handle the information assets with due care and operate them in line with the vendor / Agency’s Acceptable usage policy.", "ref_code": "SU 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "System users will conduct due diligence when accessing the web and browsing the web SHALL strictly follow Agency principles and guidelines on accessing the internet. Agencies SHOULD consider whether usage of forums, social networks, etc is permitted or not.", "ref_code": "SU 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "ICT assets are protected against web-based threats by implementing measures that will prevent downloading software programs, active content and non- business related websites.", "ref_code": "SU 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Web access is provided through secure proxies and filtering gateways as defined in section C 4, Gateway Security [GS].", "ref_code": "SU 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Staff is aware of the types of content permitted and restricted within the Agency, as specified in section B- 4, Gateway Security [GS]. Agencies SHOULD consider an effective solution for monitoring content of encrypted channels.", "ref_code": "SU 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Staff use e-mail with due diligence and include necessary classification labeling depending upon the content/attachments according to National Information Classification Policy [IAP-NAT-DCLS].", "ref_code": "SU 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Appropriate measures are taken that e-mail is protected against potential threats as viruses, trojans, spam mails, forgery and social engineering", "ref_code": "SU 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Staff is aware that web based public e-mail services are not allowed to be used to send and receive e-mails from Agency systems.", "ref_code": "SU 8", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Staff is aware that e-mails used to exchange confidential information SHOULD only be sent to named recipients and not to a group or distribution list.", "ref_code": "SU 9", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Staff is aware that the use of automatic forwarding of e-mails is dependent upon the sensitivity of their normal e-mails. Emails carrying information classified at C2 and above SHALL NOT be automatically forwarded outside to the Agency’s systems.", "ref_code": "SU 10", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "When dealing with external parties, Agencies ensure that external recipients/originators understand and agree on the usage of classified data as defined in section C- 3, Information Exchange [IE].", "ref_code": "SU 11", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Hardware containing media is classified at or above the classification of the information contained on the media", "ref_code": "MS 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Non-volatile media is classified to the highest classification of information stored on it", "ref_code": "MS 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Volatile media that has a continuous power supply is classified to the highest classification of information stored on it while the power is on. Volatile media may be treated as classified C1 information once the power is removed from the media.", "ref_code": "MS 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Storage media is reclassified if:\na. information copied onto that media is of a high classification,\nb. information contained on that media is subject to a classification upgrade", "ref_code": "MS 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Media holding classified information may be declassified after:\na. the information on the media has been declassified by the originator, \nb. the media has been sanitized in accordance with section C- 8.3, Policy & Baseline Controls - Media Sanitization", "ref_code": "MS 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "If the storage media cannot be sanitized, then it cannot be declassified and MUST be destroyed.", "ref_code": "MS 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The classification of all media is readily visually identifiable. Agencies SHOULD achieve this by labelling media with a protective marking that states the maximum classification as specified in section B-4, Data Labelling [DL]", "ref_code": "MS 7", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Classification of all media is easily visually identifiable. When using non-textual representations for classification markings due to operational security, Agencies SHALL document the labelling scheme and train staff members appropriately.", "ref_code": "MS 8", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They document procedures for the sanitisation of media, which are regularly tested.", "ref_code": "MS 9", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "All media types which contain information classified as C1 or above are destroyed prior to disposal:\na. microfiche & microfilm\nb. optical discs\nc. printer ribbons and the impact surface facing the platen\nd. programmable read-only memory\ne. read-only memory\nf. faulty media that cannot be successfully sanitised.", "ref_code": "MS 10", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Volatile media is sanitised by:\na. removing power from the media for at least 10 minutes, or\nb. overwriting all locations of the media with an arbitrary pattern followed by a read back for verification.", "ref_code": "MS 11", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Non-volatile magnetic media is sanitised by:\na. overwriting the media, if pre-2001 or under 15GB, in its entirety, with an arbitrary pattern followed by a read back for verification three times\nb. overwriting the media, if post-2001 or over 15GB, in its entirety, with an arbitrary pattern followed by a read back for verification one time; or\nc. using a degausser with sufficient field strength for the coercivity of the media (NOTE: Degaussing may render some modern media unusable)", "ref_code": "MS 12", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Non-volatile EPROM media is sanitised by erasing as per the manufacturer’s specification, increasing the specified ultraviolet erasure time by a factor of three, then overwriting the media once in its entirety with a pseudo random pattern. Sanitization of media with rating C3 & above SHOULD be documented.", "ref_code": "MS 13", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "Flash memory media is sanitized by overwriting the media twice in its entirety with a pseudo random pattern, followed by a read back for verification.", "ref_code": "MS 14", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Appropriately vetted and briefed personnel carry out repairs and maintenance for hardware containing classified information.", "ref_code": "MS 15", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Repairs on systems containing classified information rated C3 or above are carried out under supervision..", "ref_code": "MS 16", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They document procedures for the destruction and disposal of media.", "ref_code": "MS 17", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Media is destroyed by:\na. Deguassing non-volatile magnetic media\nb. breaking up the media\nc. heating the media until it has either burnt to ash or melted.", "ref_code": "MS 18", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Staff members supervise the destruction of media:\na. handling the media to the point of destruction\nb. ensuring that the destruction is completed successfully.\nc. C3 & above media destruction must be documented.", "ref_code": "MS 19", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Media, including faulty media, containing classified information is sanitised to the extent possible prior to disposal.", "ref_code": "MS 20", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The disposal of media and media waste does not attract undue attention.", "ref_code": "MS 21", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Users will be provided access based on the concept of “least privilege” and governed by a “Need to Know” or a “Need to Have” basis.", "ref_code": "AM 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Access will be managed and controlled through system access controls, identification and authentication, and audit trails based on the sensitivity of the information. These request s for access SHALL be authorized by a staff member’s supervisor or manager.", "ref_code": "AM 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Access rights of a user or entity to create, read, update, delete or transmit a Agency’s information assets SHALL be based on a matrix (hierarchical) model of rights defined by business rules established by the owners of that information.", "ref_code": "AM 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "A process is established which, upon any employee role or status change (including termination), ensures that information system access is updated to reflect the employee’s new role,", "ref_code": "AM 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "System users that need additional access to bypass security mechanisms for any reason seek formal authorisation from the Security Manager", "ref_code": "AM 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Any unauthorized effort to circumvent the Agency’s access control SHALL be perceived as a security incident, and SHALL be handled in accordance with established incident handling procedure and/or appropriate human resources policies and procedures.", "ref_code": "AM 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Audit logs SHALL be enabled and maintained in such a manner as to allow compliance monitoring with government policy and to assist in Incident Management.", "ref_code": "AM 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Logical access to Agency Networks is technically controlled. This MAY be by using Network Admission Control (NAC) services/devices.", "ref_code": "AM 8", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Secure records are maintained of:\na. all authorised system users\nb. their user identification\nc. who provided the authorisation to access the system\nd. when the authorisation was granted\ne. maintain the record for the life of the system to which access is granted.", "ref_code": "AM 9", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "A logon banner is displayed before access to the system is granted. These banners SHOULD cover:\na. access is only permitted to authorised system users\nb. the system user’s agreement to abide by relevant security policies\nc. the system user’s awareness of the possibility that system usage is being monitored\nd. the definition of acceptable use for the system\ne. legal ramifications of violating the relevant policies.\nf. Wherever possible requires a system user response, as acknowledgement", "ref_code": "AM 10", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Centralised authentication repositories such as LDAP, authentication databases, etc. are protected from denial of service attacks and use secure and authenticated channels for retrieval of authentication data. Such repositories SHALL log the following events:\na. Unauthorized update/access\nb. Start and end date and time of activity, together with system identifier\nc. User identification (for illegal logon)\nd. Sign-on and sign-off activity (for illegal logon)\ne. Session/terminal or remote connection", "ref_code": "AM 11", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They develop and maintain a set of policies, plans and procedures, derived from the National \nInformation Classification Policy [IAP-NAT-DCLS], covering system users’:\na. identification\nb. authentication\nc. authorisation", "ref_code": "AM 12", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They educate their system users of the Agency’s policies and procedures.", "ref_code": "AM 13", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "All system users are:\na. uniquely identifiable\nb. authenticated on each occasion that access is granted to a system.", "ref_code": "AM 14", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Individuals who are not employees, contractors, or consultants are not granted a user account or be given privileges to use the Agency’s information resources or communications systems unless explicitly approved by the Security Manager who SHALL check that appropriate agreements, clearance and access forms have been completed.", "ref_code": "AM 15", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "That alternate methods of determining the identification of the system user are in place when shared/non-specific accounts are used.", "ref_code": "AM 16", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Unprotected authentication information that grants system access, or decrypts an encrypted device is located on, or with the system or device, to which the authentication information grants access to.", "ref_code": "AM 17", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "System authentication data whilst in use is not susceptible to attacks including, but not limited to, replay, man-in-the-middle and session hijacking", "ref_code": "AM 18", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "A password policy enforcing either a minimum password length of 12 characters with no complexity requirement or a minimum password length of seven characters, consisting of\nat least three of the following character sets:\na. lowercase characters (a-z)\nb. uppercase characters (A-Z)\nc. digits (0-9)\nd. punctuation and special characters", "ref_code": "AM 19", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Passwords are changed at least every 90 days", "ref_code": "AM 20", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "System users cannot change their password more than once a day and the system forces the user to change an expired password on initial logon or if reset.", "ref_code": "AM 21", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Chosen passwords are checked to prevent:\na. predictable reset passwords\nb. reuse of passwords when resetting multiple accounts\nc. passwords to be reused within eight password changes\nd. users to use sequential passwords", "ref_code": "AM 22", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Screen and/or session locks configured to:\na. activate after a maximum of 15 minutes of system user inactivity\nb. activate manually by the system user, if desired\nc. lock to completely conceal all information on the screen\nd. ensure the screen does not appear to be turned off while in the locked state\ne. have the system user re-authenticate to unlock the system\nf. deny system users the ability to disable the locking mechanism.", "ref_code": "AM 23", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Access to a system is suspended after a specified number of failed logon attempts or as soon as possible after the staff member no longer needs access, due to changing roles or leaving the Agency.", "ref_code": "AM 24", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Lost, stolen, compromised passwords are immediately:\na. reported, to the Security Manager who SHALL ensure the corresponding account is suspended\nb. changed upon user identity verification", "ref_code": "AM 25", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Accounts that are inactive for more than three (3) months are suspended.", "ref_code": "AM 26", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Accounts on systems processing information rated C2, I2, A2 or above are audited for currency on a six (6) monthly basis.", "ref_code": "AM 27", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Security policies document any access requirements, security clearances and briefings necessary for system access.", "ref_code": "AM 28", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "System users have been vetted as specified in section B- 6, Personnel Security [PS], before being granted access to a system.", "ref_code": "AM 29", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "System users have received any necessary briefings before being granted access to a system.", "ref_code": "AM 30", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "The use of privileged accounts is documented, controlled and accountable and kept to a minimum. Privileged accounts SHALL only be used for administrative work", "ref_code": "AM 31", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "System administrators are assigned an individual account for undertaking their administration tasks", "ref_code": "AM 32", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Only Qatari nationals have privileged access to systems processing information classified at C4 and above unless explicit authorisation for exemption to this policy is given.", "ref_code": "AM 33", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "System management log is updated to record the following information:\na. sanitisation activities\nb. system startup and shutdown\nc. component or system failures\nd. maintenance activities\ne. backup and archival activities\nf. system recovery activities\ng. special or out of hours activities.", "ref_code": "AM 34", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Remote access SHALL NOT be provided unless authorized explicitly by the department head and only if it is warranted by business requirements and only after due diligence has been performed to analyze associated risks and suitable controls are implemented to mitigate the identified risks.", "ref_code": "AM 35", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Two factor authentication, using a hardware token, biometric control or similar is used when accessing systems processing data classified at C3 or above.", "ref_code": "AM 36", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Remote access sessions are secured by using suitable end-to-end encryption as specified in section C- 10, Cryptographic Security [CY].", "ref_code": "AM 37", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Remote access computers are equipped with at a minimum, a personal firewall and anti-malware software. These security controls SHALL be activated at all times.", "ref_code": "AM 38", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Software, including security software on these computers SHALL be patched and kept up to date.", "ref_code": "AM 39", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Users do not access Agency internal systems from public computers e.g. Cyber Cafes etc. or print material to any public computer.", "ref_code": "AM 40", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Vendor remote access is limited to situations where there are no other alternatives. In this case, initiation of the connection SHALL be controlled and monitored by the Agency. Vendor remote access SHALL only be for a defined period of time, dictated by the duration of the task being undertaken.", "ref_code": "AM 41", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The cryptographic algorithms, encryption hardware/software, key management systems and digital signatures, meet the requirements specified in Appendix B of this manual for Approved Encryption/ Cryptographic Algorithms and Systems.", "ref_code": "CY 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The lifetime of the key SHALL be determined by the primarily by the application and the information infrastructure it is used in. Keys SHALL be immediately revoked and replaced if it has been or suspected of being compromised.", "ref_code": "CY 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Information assets classified as C3 [IAP-NAT-DCLS] are encrypted and protected against unauthorized disclosure when stored and/or in transit regardless of the storing format or media. Agencies MAY apply these cryptographic controls to assets with lower confidentiality requirements, if determined necessary by their risk assessment.", "ref_code": "CY 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Information assets classified as I3 [IAP-NAT-DCLS] have assured integrity by the use of cryptographic hashing. Agencies MAY apply these cryptographic controls to assets with lower integrity requirements, if determined necessary by their risk assessment. Appendix B to this section specifies approved hashing algorithms.", "ref_code": "CY 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "The following protocols or better, with approved algorithms outlined in Appendix B, are used for securing data classified as C3 when in transit:\na. For securing web traffic: TLS (128+ bits) [RFC4346]\nb. For securing file transfers: SFTP [SFTP]\nc. For secure remote access: SSH v2 [RFC4253] or IPSEC [RFC 4301]\nd. Only S/MIME v3 [RFC3851] or better are used for securing emails. See CY11 for associated requirement.", "ref_code": "CY 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Passwords must always be encrypted/hashed and protected against unauthorized disclosure when they are stored and/or in transit regardless of the storing format or media. Privileged passwords SHALL be encrypted and stored off-site with backup files each time the password is changed to ensure complete recovery.", "ref_code": "CY 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Where Hardware Security Modules (HSMs) are used, they are certified to at least FIPS 140-2 Level 2 [FIPS-140-2] or Common Criteria [CC3.1] EAL4.", "ref_code": "CY 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Cryptographic keys are only physically moved in HSMs meeting CY5", "ref_code": "CY 8", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Suitable key management processes are defined, as per [ISO11770-1] and used to manage the lifecycle of cryptographic keys, covering the following functions:\n• Key Custodians Roles and Responsibilities\n• Key Generation\n• Dual Control and Split Knowledge\n• Secure Key Storage\n• Key Usage\n• Secure Key Distribution and in Transit\n• Key Backup and Recovery\n• Periodic Key Status Checking\n• Key Compromise\n• Key Revocation and Destruction\n• Audit Trails and Documentation", "ref_code": "CY 9", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Agency’s SHALL ensure the digital certificates are compliant to standards in use by the CSP-PMA, MOTC. Agencies SHALL use online revocation systems to minimize the risk of fraudulent use of digital certificates.", "ref_code": "CY 10", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Security token/smartcard provisioning systems of CSPs meet the requirements for Subject Device Provision Services as specified in [CWA14167-1].", "ref_code": "CY 11", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "Any digital certificates used in a production system SHALL be issued by a CSP licensed in Qatar", "ref_code": "CY 12", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They develop policies governing if, and how, Mobile Devices (MDs) and laptops can be used in their organisation.", "ref_code": "OS 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "They do not conduct classified conversations using MDs and laptops capable of conducting phone conversations while using Bluetooth-enabled peripherals.", "ref_code": "OS 2", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "MDs and laptops with Bluetooth serial port connections do not have the port enabled if the device is to hold classified information.", "ref_code": "OS 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "MDs with recording facilities are not allowed into high risk areas without prior approval from the Security Manager.", "ref_code": "OS 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "All laptops and MDs SHALL encrypt the information they carry and be password protected.", "ref_code": "OS 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "MDs and laptops SHALL be kept under continual direct supervision when in use or kept secured when not in use.", "ref_code": "OS 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "MDs and laptops not directly owned or controlled by the Agency are not used with the Agency’s systems. MDs and laptops not owned or controlled by the Agency SHALL be managed, accounted for and accredited in the same manner as agency owned devices. Agency MD’s and laptops MAY be temporary connected to a non- Agency network provided a suitable firewall is used to protect the device from any potential threats originating from the non- Agency controlled network.", "ref_code": "OS 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Unaccredited MDs and laptops do not connect to the Agency’s systems or store Agency information. However, temporary connected MDs and laptops are permitted provided they are segregated from the main networks by a firewall.", "ref_code": "OS 8", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "In case of loss or theft of the MDs or laptops, the incident should be immediately reported to the Information Security Manager / Office and the concerned Law enforcement agencies. The loss / theft SHALL be handled as per the B-8 Incident Management[IM]", "ref_code": "OS 9", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Emergency destruction/locking plan /remote wipe/auto destruct is in place for any MDs and laptops.", "ref_code": "OS 10", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Appropriate protection for physical space is determined based on an assessment of risk. This assessment SHALL occur during the design phase of a new construction or, for existing workplaces, as part of an on-going risk management process.", "ref_code": "PH 1", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Physical spaces are zoned depending upon their security requirement. Each zone is designated a physical security level.", "ref_code": "PH 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Each zone has the appropriate physical security controls implemented. Appendix A provides details of these minimal and baseline protection controls, together with recommendations for additional controls. Medium protection requires one additional class of control, whereas High protection requires two additional class of control. An Agency MAY incorporate additional controls in addition to those mandated by this policy.", "ref_code": "PH 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Implementation of a “clean desk” and “clean screen” policy.", "ref_code": "PH 4", "system_level": "", "category": "", "subcategory": "", "dti": "Easy", "dtc": "Easy", "meta": {}, "subcontrols": []}, {"name": "", "description": "Server/Data rooms meet at least the medium protection requirement", "ref_code": "PH 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Cabling carrying information at levels C1-C3 is physically separate (including for fibre optic cabling) and is in separate ducting to that carrying Nationally Classified information", "ref_code": "PH 6", "system_level": "", "category": "", "subcategory": "", "dti": "Hard", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "A site security plan and where necessary standard operating procedures (SOPs) for each secure areas are developed and implemented. Information to be covered includes, but is not limited to:\na. a summary of the protective security risk assessment\nb. roles and responsibilities of facility or ICT security officer and staff members;\nc. the administration, operation and maintenance of the electronic access control system and/or security alarm system\nd. key management, the enrolment and removal of system users and issuing of personal identification\ne. staff member clearances, security awareness training and regular briefings\nf. inspection of the generated audit trails and logs\ng. end of day checks and lockup\n h. reporting of ICT security incidents and breaches. ", "ref_code": "PH 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Evaluate the risks associated with the virtual technologies.\na. Evaluate the risks in context of relevant legal, regulatory policies and legislations.\nb. Evaluate how the introduction of virtual technology will change your existing IT infrastructure and the related risk posture.", "ref_code": "VL 1", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Harden the hypervisor, administrative layer, the virtual machine and related components as per the industry accepted best practices and security guidelines and the vendor recommendations.", "ref_code": "VL 2", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Hard", "meta": {}, "subcontrols": []}, {"name": "", "description": "Enforce least privilege and separation of duties [Refer to section C-9 Access Management] for managing the virtual environment.\na. Define specific roles and granular privileges for each administrator in the central virtualization management software.\nb. Limit direct administrative access to the hypervisor to the extent possible\nc. Depending on the risk and the classification of the information processed, Agencies should consider the use of multi factor authentication or dual or split control of administrative passwords\nbetween multiple administrators.", "ref_code": "VL 3", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Ensure adequate physical security to prevent unauthorized access to the virtual technology environment.", "ref_code": "VL 4", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Virtualized technology environment should be augmented by third party security technology to provide layered security controls (defence in depth approach) to complement the controls provided by the vendor and technology itself.", "ref_code": "VL 5", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Segregate the Virtual Machines based on the classification of data they process and / or store.", "ref_code": "VL 6", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "A change management [Refer to Section B-6 Change Management] process encompasses the virtual technology environment.\na. Ensure that virtual machine profile is updated and the integrity of the Virtual Machine image is maintained at all times.\nb. Care should be taken to maintain and update VM’s which are not in active state (dormant or no longer used).", "ref_code": "VL 7", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}, {"name": "", "description": "Logs from the virtual technology environment SHALL be logged and monitored along with other IT infrastructure. [Refer to Section B-10 Logging and Security Monitoring].", "ref_code": "VL 8", "system_level": "", "category": "", "subcategory": "", "dti": "Moderate", "dtc": "Moderate", "meta": {}, "subcontrols": []}]